# SQL for Data Science Exercises

# Objectives

This exercise is intended to showcase skills in:
* Create and populate database
* Create and replace contents in database
* Accessing and manupulating database,
* Accessissing contents of database
* Compute descriptive statistics

In [1]:
# Import necessary libraries
import pandas as pd
import numpy as np
from faker import Faker
import random
import string
import mysql.connector
import prettytable
from datetime import datetime, timedelta
from sqlalchemy import create_engine
prettytable.DEFAULT='DEFAULT'

# Load SQL magic (only works in Jupyter/IPython)
%load_ext sql

print('Libraries are ready')

Libraries are ready

# 1. Creating and populating database

The database we are going to build `HospitalDB` will contain synthetic hospital data. The database will have 6 tables which are
1. `patient_demographics`
2. `clinical_encounter`
3. `vitals_and_labs`
4. `medications`
5. `provider_information`
6. `diagnosis_dictionary`

We will be using **MySQL** as our database server.

Let's first start by establishing connection to our server

In [2]:
# establish connection to the server
%sql mysql+mysqlconnector://njado:*****@localhost:3306/HospitalDB
conn=mysql.connector.connect(user='njado', password='*****', host='localhost', database='HospitalDB')
engine = create_engine("mysql+mysqlconnector://njado:*****@localhost:3306/HospitalDB")

In [11]:
# Now let's create a database
%sql CREATE DATABASE IF NOT EXISTS HospitalDB;

 * mysql+mysqlconnector://njado:***@localhost:3306
1 rows affected.

[]

Now, since we have created our database, we can now establish connection to the database so that the next operations will be directly linked to the database

In [ ]:
# In this cell, we established connection to the database

In [8]:
# Let's test if the connection was successfull
%sql SHOW DATABASES;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
7 rows affected.

[('hospitaldb',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

Now, since we have created our database, we can start by populating database with tables mentioned above

**Let's first create patient_demographic table**

In [9]:
%%sql 
CREATE TABLE IF NOT EXISTS patient_demographics (
    pid VARCHAR(6) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
sex ENUM('Male', 'Female') NOT NULL,
dob DATE,
residence VARCHAR(200) NOT NULL,
ses ENUM('Low', 'Middle', 'High') NOT NULL,
insurance_type ENUM('RSSB', 'CBHI', 'MMI', 'Britam', 'Old Mutual', 'Radiant', 'PIH', 'None') NOT NULL,
insurance_coverage DECIMAL(5,2) NOT NULL
);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

**Now let's check columns names**

In [10]:
%sql SELECT * FROM patient_demographics LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin', 'Tate', 'Male', datetime.date(1991, 10, 20), 'Gasabo', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany', 'Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('15.00'), 1),
 ('00156I', 'Andrea', 'Taylor', 'Male', datetime.date(1977, 9, 3), 'Nyaruguru', 'High', 'CBHI', Decimal('20.00'), 48),
 ('00157V', 'Amy', 'Ramirez', 'Male', datetime.date(1945, 11, 18), 'Cyangugu', 'Low', 'CBHI', Decimal('5.00'), 80),
 ('00178H', 'Peter', 'Stuart', 'Male', datetime.date(1976, 6, 30), 'Byumba', 'High', 'Britam', Decimal('20.00'), 49)]

Alright then, since we have table variables defined, then, let's populate our table with synthetic dataset

In [11]:
# Let's first define function to generate patient id
def generate_patient_id():
    import random
    import string
    digits=''.join(random.choices(string.digits, k=5))
    letter=random.choice(string.ascii_uppercase)
    return digits+letter

# Let's test our function
for _ in range (5):
    print(generate_patient_id())

49988X
49771L
26863O
48777P
15351R

In [13]:
# Now let's create 10000 synthetic patient demographic information
fake=Faker()
sex_options = ["Male", "Female"]
ses_options = ["Low", "Middle", "High"]
insurance_types = ["RSSB", "CBHI", "MMI", "Britam", "Old Mutual", "Radiant", "PIH", "None"]
rwanda_cities = [
    "Kigali", "Butare", "Byumba", "Cyangugu", "Gisenyi", "Kibuye",
    "Muhanga", "Nyanza", "Ruhengeri", "Rwamagana", "Kibungo",
    "Kayonza", "Kamonyi", "Nyamagabe", "Nyaruguru"
]
coverage_values = [0,10,5,15,20]

# Define table
patients = []

for _ in range(3000):
    pid = generate_patient_id()
    name=fake.name()
    sex = random.choice(sex_options)
    dob = fake.date_of_birth(minimum_age=0, maximum_age=90)
    residence = random.choice(rwanda_cities)
    ses = random.choice(ses_options)
    insurance = random.choice(insurance_types)
    coverage = random.choice(coverage_values)

    # Coverage logic
    if insurance=='None':
        coverage=0
    else:
        coverage=random.choice(coverage_values[1:])
    patients.append((pid, name, sex, dob, residence, ses, insurance, coverage))

# Create dataframe from patients data
df_demographics = pd.DataFrame(patients, columns=[
    "pid", "name", "sex", "dob", "residence", "ses", "insurance_type", "insurance_coverage"
])

df_demographics.head()

,pid,name,sex,dob,residence,ses,insurance_type,insurance_coverage
0,38133Z,Alexandra Nelson,Female,1995-12-13,Muhanga,High,MMI,20
1,33664G,Paula Hernandez,Female,1982-06-22,Kigali,High,RSSB,5
2,36587P,Stephanie Carroll,Female,1980-01-31,Kamonyi,Middle,RSSB,5
3,98349M,Jason Pierce,Female,1950-10-18,Gisenyi,Middle,None,0
4,77617G,Brian Crosby,Female,1952-04-18,Byumba,High,PIH,20

In [ ]:
for _, row in df_demographics.iterrows():
    pid = row["pid"]
    name = row["name"]
    sex = row["sex"]
    dob = row["dob"]
    residence = row["residence"]
    ses = row["ses"]
    insurance_type = row["insurance_type"]
    insurance_coverage = row["insurance_coverage"]

    %sql INSERT INTO patient_demographics (pid, name, sex, dob, residence, ses, insurance_type, insurance_coverage) \
         VALUES (:pid, :name, :sex, :dob, :residence, :ses, :insurance_type, :insurance_coverage)

In [53]:
# Now let's view our table in Database
%sql SELECT * FROM patient_demographics LIMIT 5;

   mysql+mysqlconnector://njado:***@localhost:3306
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00010J', 'Cheryl Wolfe', 'Male', datetime.date(1999, 3, 23), 'Byumba', 'Middle', 'Old Mutual', Decimal('15.00')),
 ('00074Y', 'William Sloan', 'Female', datetime.date(1937, 10, 15), 'Nyamagabe', 'Low', 'MMI', Decimal('15.00')),
 ('00089Q', 'Richard Jensen', 'Female', datetime.date(1998, 4, 29), 'Kibungo', 'Low', 'RSSB', Decimal('5.00')),
 ('00140W', 'James Yang', 'Female', datetime.date(1987, 5, 16), 'Kamonyi', 'Low', 'Radiant', Decimal('20.00')),
 ('00177T', 'Julie Cox', 'Male', datetime.date(1970, 1, 8), 'Nyamagabe', 'Middle', 'None', Decimal('0.00'))]

Now let's create our second table of clinical encounter

In [85]:
%%sql 
CREATE TABLE IF NOT EXISTS clinical_encounter(
    encounter_id INT AUTO_INCREMENT PRIMARY KEY,
    pid VARCHAR(6) NOT NULL,
    encounter_date DATE NOT NULL,
    encounter_type ENUM('Outpatient', 'Inpatient') NOT NULL,
    facility VARCHAR(100) NOT NULL,
    reason_for_visit VARCHAR(200),
diagnosis_code VARCHAR(20),
procedures VARCHAR (200),
outcome ENUM('Discharged', 'Admitted', 'Referred', 'Deceased'),
followup_required BOOLEAN,
FOREIGN KEY (pid) REFERENCES patient_demographics(pid)
);

   mysql+mysqlconnector://njado:***@localhost:3306
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [14]:
# Let's now populate our clinical_encounters table
# Define patient ids in list
patient_ids=df_demographics['pid'].tolist()

encounter_types = ["Outpatient", "Inpatient"]
facilities = ["CHUB", "CHUK", "KMH", "Kibungo RH", "Kibuye RH"]
reasons = ["Fever", "Cough", "Headache", "Routine Checkup", "Injury", "Follow-up", "Screening"]
diagnostic_codes = ["J10.1", "A09", "I10", "E11", "Z00.0", "S06.0"]
procedures = ["CT Scan", "X-Ray", "MRI", "Vaccination", "Surgery"]
outcomes = ["Discharged", "Admitted", "Referred", "Deceased"]

records = []
for pid in random.sample(patient_ids, 3000):
    encounter_date=fake.date_between(start_date='-2y', end_date='today')
    encounter_type=random.choice(encounter_types)
    facility=random.choice(facilities)
    reason_for_visit=random.choice(reasons)
    diagnostic_code=random.choice(diagnostic_codes)
    procedure = random.choice(procedures)
    outcome = random.choice(outcomes)
    followup_required = random.choice([True, False])
    
    records.append([pid, encounter_date, encounter_type, facility,
                   reason_for_visit, diagnostic_code, procedure, outcome,
                   followup_required])

df_encounters = pd.DataFrame(records, columns=[
    'pid', 'encounter_date', 'encounter_type', 'facility', 'reason_for_visit',
    'diagnostic_code', 'procedure', 'outcome', 'followup_required'
])

df_encounters.head()

,pid,encounter_date,encounter_type,facility,reason_for_visit,diagnostic_code,procedure,outcome,followup_required
0,40127J,2024-07-07,Inpatient,Kibungo RH,Cough,J10.1,Vaccination,Admitted,True
1,17526B,2025-03-22,Outpatient,CHUB,Follow-up,J10.1,Surgery,Admitted,True
2,04689S,2024-08-30,Outpatient,CHUB,Cough,I10,X-Ray,Discharged,False
3,83376T,2024-03-03,Outpatient,Kibuye RH,Screening,Z00.0,Surgery,Admitted,True
4,73712X,2025-07-14,Outpatient,CHUK,Injury,S06.0,CT Scan,Discharged,False

In [ ]:
# Now let's add our data to the table
for _, row in df_encounters.iterrows():
    pid=row['pid']
    encounter_date = row['encounter_date']
    encounter_type = row['encounter_type']
    facility = row['facility']
    reason_for_visit = row['reason_for_visit']
    diagnosis_code = row['diagnostic_code']
    procedures = row['procedure']
    outcome = row['outcome']
    followup_required= int(row['followup_required'])

    %sql INSERT INTO clinical_encounter (pid, encounter_date, encounter_type, facility, reason_for_visit, diagnosis_code, procedures, outcome, followup_required) VALUES (:pid, :encounter_date, :encounter_type, :facility, :reason_for_visit, :diagnosis_code, :procedures, :outcome, :followup_required)

In [94]:
# review the content
%sql SELECT * FROM clinical_encounter LIMIT 5;

   mysql+mysqlconnector://njado:***@localhost:3306
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(1, '65639B', datetime.date(2024, 12, 5), 'Outpatient', 'Kibuye RH', 'Routine Checkup', 'E11', 'Vaccination', 'Deceased', 0),
 (2, '66344D', datetime.date(2024, 10, 15), 'Inpatient', 'Kibungo RH', 'Screening', 'A09', 'Surgery', 'Admitted', 1),
 (3, '28988C', datetime.date(2025, 2, 12), 'Outpatient', 'CHUK', 'Headache', 'J10.1', 'MRI', 'Admitted', 1),
 (4, '50817R', datetime.date(2024, 4, 13), 'Outpatient', 'CHUB', 'Fever', 'A09', 'MRI', 'Discharged', 1),
 (5, '64615P', datetime.date(2025, 5, 17), 'Inpatient', 'CHUB', 'Screening', 'I10', 'CT Scan', 'Discharged', 1)]

Now we have two tables in our Database. Let's add third table of vital signs and investigations

In [5]:
%%sql 
CREATE TABLE IF NOT EXISTS vitals_and_labs (
    vital_lab_id INT AUTO_INCREMENT PRIMARY KEY,
pid VARCHAR(6) NOT NULL,
bp_systole INT,
bp_diastole INT,
heart_rate INT,
respiratory_rate INT,
temperature DECIMAL(4,1),
oxygen_saturation INT,
weight DECIMAL(5,2),
height DECIMAL (5,2),
BMI DECIMAL (5,2),
lab_test_name VARCHAR(200),
lab_result_value VARCHAR(50),
lab_result_unit VARCHAR(20),
lab_result_flag ENUM('Normal', 'Abnormal', 'Critical'),
collection_date DATE,
FOREIGN KEY (pid) REFERENCES patient_demographics(pid)
)

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [15]:
# Now let's generate synthetic data for 3000 patients

# Define normal ranges for labs
lab_tests = {
    'Hemoglobin': {'units': 'g/dL', 'normal_range': (12,16)},
    'Glucosemia': {'units': 'mmol/L', 'normal_range': (3.9,7.0)},
    'Creatinine': {'units': 'mg/dL', 'normal_range': (0.6, 1.3)},
    'HIV Test': {'units': '', 'normal_range':('Negative',)},
    'Malaria RDT': {'units': '', 'normal_range': ('Negative',)}
}

data=[]

for _, encounter in df_encounters.iterrows():
    pid=encounter['pid']
    encounter_date=encounter['encounter_date']

    # Generate Vitals
    bp_systole=random.randint(100,180)
    bp_diastole=random.randint(60,110)
    heart_rate = random.randint(60,100)
    respiratory_rate = random.randint(12,20)
    temperature = round(random.uniform(36.0,40.0),1)
    oxygen_saturation = random.randint(92,100)
    weight = round(random.uniform(45, 90), 1)
    height = round(random.uniform(150, 190), 1)
    BMI = round(weight / ((height/100)**2), 1)

    # Pick a lab test
    lab_test_name = random.choice(list(lab_tests.keys()))
    normal_range = lab_tests[lab_test_name]["normal_range"]
    units = lab_tests[lab_test_name]["units"]
    
    # Generate lab result
    if lab_test_name in ["HIV Test", "Malaria RDT"]:
        lab_result_value = random.choice(["Negative", "Positive"])
        if lab_result_value == "Negative":
            lab_result_flag = "Normal"
        else:
            lab_result_flag = random.choice(["Critical"])
    else:
        value = round(random.uniform(normal_range[0]-2, normal_range[1]+2), 1)
        lab_result_value = value
        if normal_range[0] <= value <= normal_range[1]:
            lab_result_flag = "Normal"
        elif abs(value - normal_range[0]) <= 1 or abs(value - normal_range[1]) <= 1:
            lab_result_flag = "Abnormal"
        else:
            lab_result_flag = "Critical"
    # Collection date within 3 days of encounter
    collection_date = encounter_date + timedelta(days=random.randint(0, 3))

    data.append([
        pid, bp_systole, bp_diastole, heart_rate, respiratory_rate,
        temperature, oxygen_saturation, weight, height, BMI,
        lab_test_name, lab_result_value, units, lab_result_flag, collection_date
    ])

df_vitals_labs = pd.DataFrame(data, columns=[
    "pid", "bp_systole", "bp_diastole", "heart_rate", "respiratory_rate",
    "temperature", "oxygen_saturation", "weight", "height", "BMI",
    "lab_test_name", "lab_result_value", "lab_result_unit", "lab_result_flag", "collection_date"
])

df_vitals_labs.head()

,pid,bp_systole,bp_diastole,heart_rate,respiratory_rate,temperature,oxygen_saturation,weight,height,BMI,lab_test_name,lab_result_value,lab_result_unit,lab_result_flag,collection_date
0,40127J,163,85,88,14,38.1,98,45.5,166.2,16.5,Hemoglobin,15.3,g/dL,Normal,2024-07-07
1,17526B,114,83,67,13,39.8,94,83.5,158.0,33.4,Malaria RDT,Positive,,Critical,2025-03-23
2,04689S,172,89,80,17,39.3,100,79.7,176.2,25.7,HIV Test,Positive,,Critical,2024-08-30
3,83376T,110,87,83,16,39.0,96,73.2,188.5,20.6,Malaria RDT,Negative,,Normal,2024-03-06
4,73712X,161,87,93,13,37.0,100,87.9,181.0,26.8,Hemoglobin,17.8,g/dL,Critical,2025-07-17

In [16]:
# Now let's populate our data into vitals_and_labs table
df_vitals_labs.to_sql('vitals_and_labs', con=engine, if_exists='append', index=False)

3000

In [128]:
# Let's now evaluate the content of table
%sql SELECT * FROM vitals_and_labs LIMIT 5;

   mysql+mysqlconnector://njado:***@localhost:3306
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(1, '65639B', 103, 74, 75, 20, Decimal('39.6'), 100, Decimal('67.20'), Decimal('179.50'), Decimal('20.90'), 'Malaria RDT', 'Positive', '', 'Critical', datetime.date(2024, 12, 7)),
 (2, '66344D', 143, 80, 86, 17, Decimal('39.7'), 99, Decimal('59.00'), Decimal('155.10'), Decimal('24.50'), 'HIV Test', 'Positive', '', 'Critical', datetime.date(2024, 10, 15)),
 (3, '28988C', 166, 76, 67, 16, Decimal('39.7'), 94, Decimal('83.40'), Decimal('151.30'), Decimal('36.40'), 'Malaria RDT', 'Negative', '', 'Normal', datetime.date(2025, 2, 14)),
 (4, '50817R', 152, 87, 82, 20, Decimal('38.5'), 94, Decimal('79.20'), Decimal('165.80'), Decimal('28.80'), 'Hemoglobin', '14.0', 'g/dL', 'Normal', datetime.date(2024, 4, 13)),
 (5, '64615P', 153, 95, 93, 13, Decimal('37.7'), 98, Decimal('74.10'), Decimal('180.30'), Decimal('22.80'), 'Hemoglobin', '15.9', 'g/dL', 'Normal', datetime.date(2025, 5, 17))]

Now the next step is to create `medications` table in our database

In [138]:
%%sql 
CREATE TABLE IF NOT EXISTS medications(
    med_id INT AUTO_INCREMENT PRIMARY KEY,
pid VARCHAR(6),
diagnosis_code VARCHAR(20),
drug_name VARCHAR(100),
drug_class VARCHAR(50),
dosage VARCHAR(50),
route ENUM('Oral', 'IV', 'IM', 'Topical', 'Inhalation'),
duration_days INT,
start_date DATE,
end_date DATE,
prescriber VARCHAR(100),
FOREIGN KEY(pid) REFERENCES patient_demographics(pid)
);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

Because we will need prescriber info, let's create a table for providers alongside

In [139]:
%%sql 
CREATE TABLE IF NOT EXISTS provider_information(
    license_number VARCHAR(8) PRIMARY KEY,
    provider_name VARCHAR(100) NOT NULL,
    speciality VARCHAR(50),
facility VARCHAR(100),
contact_phone VARCHAR(13),
contact_email VARCHAR(100)
)

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

Now let's populate our `provider_information` table

In [145]:
# define facilities and specialities
facilities = ['Kibuye RH', 'CHUK', 'CHUB', 'Kibungo RH', 'KMH']
specialities = ['Internal Medicine', 'Emergency', 'Surgery']
provider_names = ["Dr. Uwimana", "Dr. Nkurunziza", "Dr. Mukamana",
            "Dr. Habimana", "Dr. Uwase", "Dr. Mugisha",
            "Dr. Uwamahoro", "Dr. Kayitesi", "Dr. Iradukunda",
            "Dr. Hakizimana", "Dr. Ndahiro", "Dr. Umutoni",
            "Dr. Aline", "Dr. Leandre", "Dr. Manase"
]

provider_records = []

for facility in facilities:
    for speciality in specialities:

        # Generate license numbers
        license_number='RMDC'+str(random.randint(1000,9999))

        # Generate provide name
        provider_name = random.choice(provider_names)

        # Generate contact phone numbers
        prefix='+2507'+random.choice(['8','9'])
        contact_phone = prefix+''.join([str(random.randint(0,9)) for _ in range(7)])

        # Generate contact email adress
        email_local = provider_name.lower().replace(' ','')
        contact_email = f'{email_local}@{facility.replace(" ", "").lower()}.rw'
        provider_records.append([license_number, provider_name, speciality, facility, contact_phone, contact_email])

# Create a dataframe
df_providers = pd.DataFrame(provider_records, columns=[
    'license_number', 'provider_name', 'speciality', 'facility', 'contact_phone', 'contact_email'
])

df_providers.head()

,license_number,provider_name,speciality,facility,contact_phone,contact_email
0,RMDC1079,Dr. Mugisha,Internal Medicine,Kibuye RH,+250796987594,dr.mugisha@kibuyerh.rw
1,RMDC9608,Dr. Leandre,Emergency,Kibuye RH,+250791859053,dr.leandre@kibuyerh.rw
2,RMDC7540,Dr. Uwase,Surgery,Kibuye RH,+250781812221,dr.uwase@kibuyerh.rw
3,RMDC6153,Dr. Kayitesi,Internal Medicine,CHUK,+250797150850,dr.kayitesi@chuk.rw
4,RMDC8773,Dr. Umutoni,Emergency,CHUK,+250795105909,dr.umutoni@chuk.rw

In [147]:
# Now let's populate our data into provider_information
df_providers.to_sql('provider_information', con=engine, if_exists='append', index=False)

15

In [148]:
# Let's have a view at our provide info table
%sql SELECT * FROM provider_information;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
15 rows affected.

[('RMDC1079', 'Dr. Mugisha', 'Internal Medicine', 'Kibuye RH', '+250796987594', 'dr.mugisha@kibuyerh.rw'),
 ('RMDC2727', 'Dr. Uwamahoro', 'Surgery', 'CHUB', '+250790313569', 'dr.uwamahoro@chub.rw'),
 ('RMDC3353', 'Dr. Ndahiro', 'Emergency', 'KMH', '+250792164940', 'dr.ndahiro@kmh.rw'),
 ('RMDC4131', 'Dr. Hakizimana', 'Internal Medicine', 'Kibungo RH', '+250789404742', 'dr.hakizimana@kibungorh.rw'),
 ('RMDC5747', 'Dr. Ndahiro', 'Emergency', 'Kibungo RH', '+250795007794', 'dr.ndahiro@kibungorh.rw'),
 ('RMDC6075', 'Dr. Umutoni', 'Surgery', 'Kibungo RH', '+250797590291', 'dr.umutoni@kibungorh.rw'),
 ('RMDC6153', 'Dr. Kayitesi', 'Internal Medicine', 'CHUK', '+250797150850', 'dr.kayitesi@chuk.rw'),
 ('RMDC6495', 'Dr. Aline', 'Emergency', 'CHUB', '+250792364313', 'dr.aline@chub.rw'),
 ('RMDC6620', 'Dr. Uwamahoro', 'Internal Medicine', 'KMH', '+250794657680', 'dr.uwamahoro@kmh.rw'),
 ('RMDC7286', 'Dr. Nkurunziza', 'Surgery', 'KMH', '+250787002654', 'dr.nkurunziza@kmh.rw'),
 ('RMDC7353', 'Dr. Mukamana', 'Internal Medicine', 'CHUB', '+250781127007', 'dr.mukamana@chub.rw'),
 ('RMDC7540', 'Dr. Uwase', 'Surgery', 'Kibuye RH', '+250781812221', 'dr.uwase@kibuyerh.rw'),
 ('RMDC8308', 'Dr. Uwimana', 'Surgery', 'CHUK', '+250798768910', 'dr.uwimana@chuk.rw'),
 ('RMDC8773', 'Dr. Umutoni', 'Emergency', 'CHUK', '+250795105909', 'dr.umutoni@chuk.rw'),
 ('RMDC9608', 'Dr. Leandre', 'Emergency', 'Kibuye RH', '+250791859053', 'dr.leandre@kibuyerh.rw')]

In [146]:
%sql select

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
18 rows affected.

[]

In [159]:
# Now let's populate our medications table

# Step 1: Load providers & patients from DB

df_providers = pd.read_sql("SELECT provider_name, speciality FROM provider_information", con=engine)
df_patients = pd.read_sql("SELECT pid FROM patient_demographics", con=engine)
df_labs = pd.read_sql("SELECT pid, collection_date FROM vitals_and_labs", con=engine)

providers = df_providers[['provider_name','speciality']].to_dict('records')
patient_ids = df_patients['pid'].tolist()

# Step 2: Diagnosis  Medication mapping

medication_map = {
    "E11": [("Metformin", "Antidiabetic", "850 mg daily", "Oral", 30)],
    "A09": [("Ciprofloxacin", "Antibiotic", "500 mg twice daily", "Oral", 7),
            ("ORS", "Rehydration", "1 sachet after each loose stool", "Oral", 3)],
    "J10.1": [("Oseltamivir", "Antiviral", "75 mg twice daily", "Oral", 5),
              ("Paracetamol", "Analgesic", "500 mg every 6h", "Oral", 5)],
    "I10": [("Amlodipine", "Antihypertensive", "5 mg daily", "Oral", 30)],
    "Z00.0": [],  # General exam  no meds
    "S06.0": [("Paracetamol", "Analgesic", "500 mg every 6h", "Oral", 7)],
    "B20": [("Tenofovir", "Antiretroviral", "300 mg daily", "Oral", 30)],  # HIV
    "B50": [("Artemether-Lumefantrine", "Antimalarial", "20/120 mg twice daily", "Oral", 3)]  # Malaria
}

# Step 3: Diagnosis  Required Specialty mapping

diagnosis_specialty_map = {
    "S06.0": "Surgery",          # Concussion
    "J10.1": "Emergency",          # Influenza
    "A09": "Internal Medicine",    # Gastroenteritis
    "E11": "Internal Medicine",    # Diabetes
    "I10": "Internal Medicine",    # Hypertension
    "B20": "Internal Medicine",    # HIV
    "B50": "Internal Medicine",    # Malaria
    "Z00.0": None                  # General exam
}

# Step 4: Helper function to get provider by specialty

def get_provider_for_diagnosis(diagnosis_code):
    required_specialty = diagnosis_specialty_map.get(diagnosis_code)
    if not required_specialty:
        return None
    eligible = [p['provider_name'] for p in providers if p['speciality'] == required_specialty]
    if not eligible:
        return None
    return random.choice(eligible)

# Step 5: Generate synthetic medication records

records = []

for _, row in df_labs.iterrows():
    pid = row['pid']
    diagnosis_code = random.choice(list(medication_map.keys()))
    meds = medication_map[diagnosis_code]
    
    if not meds:
        continue
    
    prescriber = get_provider_for_diagnosis(diagnosis_code)
    if not prescriber:
        continue
    
    for drug_name, drug_class, dosage, route, duration in meds:
        start_date = pd.to_datetime(collection_date)
        end_date = start_date + pd.Timedelta(days=duration)
        
        records.append([
            pid, diagnosis_code, drug_name, drug_class, dosage,
            route, duration, start_date.date(), end_date.date(), prescriber
        ])

df_medications = pd.DataFrame(records, columns=[
    "pid","diagnosis_code","drug_name","drug_class","dosage",
    "route","duration_days","start_date","end_date","prescriber"
])

print(df_medications.head(10))

# Step 6: Insert into SQL table

df_medications.to_sql(
    'medications',
    con=engine,
    if_exists='append',  # append new rows
    index=False
)

      pid diagnosis_code                drug_name        drug_class  \
0  65639B            I10               Amlodipine  Antihypertensive
1  28988C            B20                Tenofovir    Antiretroviral
2  50817R          J10.1              Oseltamivir         Antiviral
3  50817R          J10.1              Paracetamol         Analgesic
4  64615P            I10               Amlodipine  Antihypertensive
5  19781C            E11                Metformin      Antidiabetic
6  26800B            B50  Artemether-Lumefantrine      Antimalarial
7  73390A            B20                Tenofovir    Antiretroviral
8  63261Q            E11                Metformin      Antidiabetic
9  64097I          S06.0              Paracetamol         Analgesic

                  dosage route  duration_days  start_date    end_date  \
0             5 mg daily  Oral             30  2024-11-18  2024-12-18
1           300 mg daily  Oral             30  2024-11-18  2024-12-18
2      75 mg twice daily  Oral              5  2024-11-18  2024-11-23
3        500 mg every 6h  Oral              5  2024-11-18  2024-11-23
4             5 mg daily  Oral             30  2024-11-18  2024-12-18
5           850 mg daily  Oral             30  2024-11-18  2024-12-18
6  20/120 mg twice daily  Oral              3  2024-11-18  2024-11-21
7           300 mg daily  Oral             30  2024-11-18  2024-12-18
8           850 mg daily  Oral             30  2024-11-18  2024-12-18
9        500 mg every 6h  Oral              7  2024-11-18  2024-11-25

       prescriber
0     Dr. Mugisha
1  Dr. Hakizimana
2     Dr. Ndahiro
3     Dr. Ndahiro
4    Dr. Mukamana
5    Dr. Kayitesi
6    Dr. Mukamana
7    Dr. Kayitesi
8    Dr. Kayitesi
9       Dr. Uwase

3361

In [161]:
# Let's review our medications table
%sql select * from medications limit 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(1, '65639B', 'I10', 'Amlodipine', 'Antihypertensive', '5 mg daily', 'Oral', 30, datetime.date(2024, 11, 18), datetime.date(2024, 12, 18), 'Dr. Mugisha'),
 (2, '28988C', 'B20', 'Tenofovir', 'Antiretroviral', '300 mg daily', 'Oral', 30, datetime.date(2024, 11, 18), datetime.date(2024, 12, 18), 'Dr. Hakizimana'),
 (3, '50817R', 'J10.1', 'Oseltamivir', 'Antiviral', '75 mg twice daily', 'Oral', 5, datetime.date(2024, 11, 18), datetime.date(2024, 11, 23), 'Dr. Ndahiro'),
 (4, '50817R', 'J10.1', 'Paracetamol', 'Analgesic', '500 mg every 6h', 'Oral', 5, datetime.date(2024, 11, 18), datetime.date(2024, 11, 23), 'Dr. Ndahiro'),
 (5, '64615P', 'I10', 'Amlodipine', 'Antihypertensive', '5 mg daily', 'Oral', 30, datetime.date(2024, 11, 18), datetime.date(2024, 12, 18), 'Dr. Mukamana')]

**Now since we are done with creating tables, we can check for their properties**

In [164]:
%%sql 
SELECT table_name, table_type, engine, table_rows
FROM information_schema.tables
WHERE table_schema = 'HospitalDB';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('clinical_encounter', 'BASE TABLE', 'InnoDB', 3000),
 ('medications', 'BASE TABLE', 'InnoDB', 3297),
 ('patient_demographics', 'BASE TABLE', 'InnoDB', 2998),
 ('provider_information', 'BASE TABLE', 'InnoDB', 15),
 ('vitals_and_labs', 'BASE TABLE', 'InnoDB', 3000)]

In [167]:
# Table columns description
print('Patient demographics\n')
%sql describe patient_demographics;

Patient demographics

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[('pid', 'varchar(6)', 'NO', 'PRI', None, ''),
 ('name', 'varchar(200)', 'NO', '', None, ''),
 ('sex', "enum('Male','Female')", 'NO', '', None, ''),
 ('dob', 'date', 'YES', '', None, ''),
 ('residence', 'varchar(200)', 'NO', '', None, ''),
 ('ses', "enum('Low','Middle','High')", 'NO', '', None, ''),
 ('insurance_type', "enum('RSSB','CBHI','MMI','Britam','Old Mutual','Radiant','PIH','None')", 'NO', '', None, ''),
 ('insurance_coverage', 'decimal(5,2)', 'NO', '', None, '')]

# 2. Creating, replacing, and manipulating contents in Database

### Data retrieval

In [169]:
# Let's retrieve the first 10 patients in our database
%sql SELECT * FROM patient_demographics limit 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('00026B', 'Dustin Tate', 'Male', datetime.date(1991, 10, 20), 'Byumba', 'Middle', 'MMI', Decimal('5.00')),
 ('00146Z', 'Bethany Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('20.00')),
 ('00156I', 'Andrea Taylor', 'Male', datetime.date(1977, 9, 3), 'Nyaruguru', 'High', 'CBHI', Decimal('20.00')),
 ('00157V', 'Amy Ramirez', 'Male', datetime.date(1945, 11, 18), 'Cyangugu', 'Low', 'CBHI', Decimal('5.00')),
 ('00178H', 'Peter Stuart', 'Male', datetime.date(1976, 6, 30), 'Byumba', 'High', 'Britam', Decimal('20.00')),
 ('00250W', 'Amanda Wilson', 'Male', datetime.date(1992, 2, 12), 'Kibuye', 'High', 'MMI', Decimal('10.00')),
 ('00266K', 'Cody Lloyd', 'Male', datetime.date(1944, 10, 13), 'Nyamagabe', 'Low', 'PIH', Decimal('5.00')),
 ('00292K', 'Jason Silva', 'Male', datetime.date(1983, 12, 14), 'Muhanga', 'Low', 'Britam', Decimal('10.00')),
 ('00305E', 'Aaron Newman', 'Female', datetime.date(1945, 2, 13), 'Ruhengeri', 'Low', 'CBHI', Decimal('20.00')),
 ('00315K', 'Mark Davis', 'Male', datetime.date(1955, 6, 18), 'Gisenyi', 'Middle', 'PIH', Decimal('10.00'))]

In [170]:
# Let's retrieve only patient name, patient code, and gender
%sql SELECT pid, name, sex FROM patient_demographics LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin Tate', 'Male'),
 ('00146Z', 'Bethany Lara', 'Male'),
 ('00156I', 'Andrea Taylor', 'Male'),
 ('00157V', 'Amy Ramirez', 'Male'),
 ('00178H', 'Peter Stuart', 'Male')]

In [171]:
# Now, let's display unique diagnosis along with their enccounters we have,
%sql SELECT DISTINCT(diagnosis_code), COUNT(*) as encounter_count FROM clinical_encounter GROUP BY diagnosis_code;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('E11', 487),
 ('A09', 506),
 ('J10.1', 547),
 ('I10', 486),
 ('Z00.0', 479),
 ('S06.0', 495)]

We can see that the most frequent diagnosis is J10.1 representing influenza (flu) caused by a specific influenza virus, and the illness is accompanied by respiratory symptoms such as cough, sore throat, or shortness of breath

In [175]:
# Now let's display the most 5 recent lab encounters and results
%sql SELECT * from vitals_and_labs ORDER BY collection_date DESC LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(2668, '80446D', 178, 88, 84, 17, Decimal('37.4'), 95, Decimal('68.40'), Decimal('187.50'), Decimal('19.50'), 'Malaria RDT', 'Negative', '', 'Normal', datetime.date(2025, 11, 30)),
 (2458, '00391J', 137, 70, 93, 20, Decimal('37.2'), 99, Decimal('47.80'), Decimal('175.00'), Decimal('15.60'), 'Hemoglobin', '13.3', 'g/dL', 'Normal', datetime.date(2025, 11, 29)),
 (2590, '40573L', 102, 60, 79, 19, Decimal('38.7'), 100, Decimal('57.70'), Decimal('158.80'), Decimal('22.90'), 'HIV Test', 'Positive', '', 'Critical', datetime.date(2025, 11, 29)),
 (356, '24650U', 160, 76, 97, 14, Decimal('36.2'), 94, Decimal('51.00'), Decimal('176.30'), Decimal('16.40'), 'Hemoglobin', '13.8', 'g/dL', 'Normal', datetime.date(2025, 11, 28)),
 (994, '33005P', 168, 65, 69, 15, Decimal('38.1'), 95, Decimal('71.40'), Decimal('178.90'), Decimal('22.30'), 'Glucosemia', '5.3', 'mmol/L', 'Normal', datetime.date(2025, 11, 28))]

In [180]:
# Now let's find all patients older than 89

%sql SELECT pid, name, dob from patient_demographics WHERE TIMESTAMPDIFF(YEAR, dob, CURDATE())>89;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
37 rows affected.

[('01133C', 'Christopher Castro', datetime.date(1935, 1, 8)),
 ('03282K', 'Kylie Sutton', datetime.date(1935, 10, 4)),
 ('04862K', 'Travis Johnston', datetime.date(1934, 12, 14)),
 ('05254C', 'Jason Hanson', datetime.date(1935, 4, 30)),
 ('09178F', 'Kenneth Simon', datetime.date(1935, 5, 30)),
 ('09766Q', 'Matthew Faulkner', datetime.date(1935, 8, 11)),
 ('10315H', 'Stephen Hickman', datetime.date(1935, 8, 13)),
 ('15850J', 'Jonathan Lee', datetime.date(1935, 6, 22)),
 ('16909I', 'Kristine Soto', datetime.date(1935, 9, 9)),
 ('22567E', 'Mrs. Lindsey Huffman', datetime.date(1935, 9, 22)),
 ('26837W', 'Elizabeth Frost', datetime.date(1935, 1, 27)),
 ('27782K', 'Dennis Mccullough', datetime.date(1935, 10, 17)),
 ('41111J', 'Matthew Krause', datetime.date(1934, 12, 16)),
 ('42962P', 'Brenda Whitehead', datetime.date(1935, 11, 20)),
 ('46706B', 'Michael Lopez', datetime.date(1935, 9, 10)),
 ('51271T', 'Vincent Reeves', datetime.date(1935, 7, 11)),
 ('54778R', 'Christopher Munoz', datetime.date(1935, 8, 6)),
 ('55896B', 'Steven Miles', datetime.date(1935, 9, 6)),
 ('56996X', 'Tara Watson', datetime.date(1935, 11, 12)),
 ('66429Q', 'Natalie George', datetime.date(1935, 5, 15)),
 ('67500A', 'Dale Turner', datetime.date(1935, 9, 17)),
 ('68714O', 'Tara Washington', datetime.date(1935, 5, 29)),
 ('68981H', 'Andrew Fisher', datetime.date(1935, 11, 27)),
 ('69048C', 'Sara Peterson', datetime.date(1935, 3, 31)),
 ('69738Y', 'Nicole Hays', datetime.date(1934, 12, 31)),
 ('73367X', 'Teresa Frank', datetime.date(1935, 4, 6)),
 ('74806Z', 'Joshua Jones', datetime.date(1935, 2, 22)),
 ('76617D', 'Renee Li', datetime.date(1935, 6, 2)),
 ('83198P', 'Andrew Johnson', datetime.date(1935, 4, 25)),
 ('83889T', 'Sue Lee', datetime.date(1935, 2, 28)),
 ('85901T', 'Mark Carter', datetime.date(1934, 12, 10)),
 ('89373W', 'Joseph King', datetime.date(1935, 3, 12)),
 ('93148X', 'Martin Black', datetime.date(1935, 10, 25)),
 ('94947F', 'Jennifer Hernandez', datetime.date(1935, 6, 23)),
 ('97276J', 'Susan Williams', datetime.date(1935, 10, 22)),
 ('98915P', 'Maria Fuller', datetime.date(1935, 10, 20)),
 ('99710N', 'Pamela Cole', datetime.date(1935, 11, 16))]

Now let's add a column called age in patient_demographics the find 10 most oldest patients

In [181]:
%%sql 
ALTER TABLE patient_demographics ADD COLUMN age INT;
UPDATE patient_demographics SET age = TIMESTAMPDIFF(YEAR, dob, CURDATE());
SELECT pid, name, age FROM patient_demographics ORDER BY age DESC LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
2998 rows affected.
10 rows affected.

[('09766Q', 'Matthew Faulkner', 90),
 ('22567E', 'Mrs. Lindsey Huffman', 90),
 ('04862K', 'Travis Johnston', 90),
 ('03282K', 'Kylie Sutton', 90),
 ('15850J', 'Jonathan Lee', 90),
 ('01133C', 'Christopher Castro', 90),
 ('10315H', 'Stephen Hickman', 90),
 ('16909I', 'Kristine Soto', 90),
 ('05254C', 'Jason Hanson', 90),
 ('09178F', 'Kenneth Simon', 90)]

In [182]:
# Let's retrieve 10 patients with diagnosis E11 (Diabetes)
%sql SELECT * FROM clinical_encounter WHERE diagnosis_code='E11' LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[(1, '65639B', datetime.date(2024, 12, 5), 'Outpatient', 'Kibuye RH', 'Routine Checkup', 'E11', 'Vaccination', 'Deceased', 0),
 (7, '26800B', datetime.date(2025, 6, 22), 'Inpatient', 'CHUK', 'Headache', 'E11', 'Surgery', 'Discharged', 1),
 (14, '62269E', datetime.date(2024, 7, 24), 'Outpatient', 'KMH', 'Follow-up', 'E11', 'CT Scan', 'Discharged', 1),
 (17, '69355E', datetime.date(2024, 4, 25), 'Inpatient', 'Kibuye RH', 'Fever', 'E11', 'Vaccination', 'Admitted', 0),
 (18, '94238I', datetime.date(2024, 7, 1), 'Inpatient', 'CHUB', 'Fever', 'E11', 'Surgery', 'Deceased', 0),
 (24, '44193K', datetime.date(2025, 7, 4), 'Outpatient', 'CHUK', 'Headache', 'E11', 'MRI', 'Discharged', 0),
 (36, '99281M', datetime.date(2024, 6, 6), 'Outpatient', 'Kibuye RH', 'Routine Checkup', 'E11', 'MRI', 'Deceased', 1),
 (37, '07517V', datetime.date(2024, 12, 3), 'Outpatient', 'CHUB', 'Screening', 'E11', 'X-Ray', 'Admitted', 0),
 (39, '58493W', datetime.date(2025, 5, 24), 'Inpatient', 'KMH', 'Screening', 'E11', 'X-Ray', 'Admitted', 1),
 (43, '71400I', datetime.date(2023, 12, 27), 'Outpatient', 'CHUB', 'Screening', 'E11', 'MRI', 'Admitted', 0)]

In [185]:
# Let's check for distinct diagnosis grouped by facility
%sql SELECT facility, diagnosis_code, COUNT(*) as diagnosis_count FROM clinical_encounter GROUP BY facility, diagnosis_code ORDER BY facility, diagnosis_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
30 rows affected.

[('CHUB', 'J10.1', 105),
 ('CHUB', 'A09', 101),
 ('CHUB', 'I10', 95),
 ('CHUB', 'S06.0', 93),
 ('CHUB', 'Z00.0', 92),
 ('CHUB', 'E11', 88),
 ('CHUK', 'J10.1', 121),
 ('CHUK', 'A09', 103),
 ('CHUK', 'E11', 102),
 ('CHUK', 'S06.0', 102),
 ('CHUK', 'Z00.0', 99),
 ('CHUK', 'I10', 95),
 ('Kibungo RH', 'Z00.0', 108),
 ('Kibungo RH', 'J10.1', 102),
 ('Kibungo RH', 'E11', 102),
 ('Kibungo RH', 'A09', 101),
 ('Kibungo RH', 'I10', 99),
 ('Kibungo RH', 'S06.0', 89),
 ('Kibuye RH', 'E11', 105),
 ('Kibuye RH', 'S06.0', 105),
 ('Kibuye RH', 'A09', 104),
 ('Kibuye RH', 'J10.1', 102),
 ('Kibuye RH', 'Z00.0', 95),
 ('Kibuye RH', 'I10', 94),
 ('KMH', 'J10.1', 117),
 ('KMH', 'S06.0', 106),
 ('KMH', 'I10', 103),
 ('KMH', 'A09', 97),
 ('KMH', 'E11', 90),
 ('KMH', 'Z00.0', 85)]

In [191]:
# Now let's check for distinct grug_class
%sql SELECT DISTINCT drug_class FROM medications;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[('Antihypertensive',),
 ('Antiretroviral',),
 ('Antiviral',),
 ('Analgesic',),
 ('Antidiabetic',),
 ('Antimalarial',),
 ('Antibiotic',),
 ('Rehydration',)]

In [195]:
# Let's retrieve distinct prescribers who prescribed antibiotics along with the count
%sql SELECT prescriber, COUNT(*) as prescription_count FROM medications WHERE drug_class='Antibiotic' GROUP BY prescriber ORDER BY prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('Dr. Uwamahoro', 82),
 ('Dr. Kayitesi', 78),
 ('Dr. Hakizimana', 75),
 ('Dr. Mugisha', 73),
 ('Dr. Mukamana', 72)]

In [196]:
# Now let's review the medications table to check the content
%sql DESCRIBE medications;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
11 rows affected.

[('med_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('pid', 'varchar(6)', 'YES', 'MUL', None, ''),
 ('diagnosis_code', 'varchar(20)', 'YES', '', None, ''),
 ('drug_name', 'varchar(100)', 'YES', '', None, ''),
 ('drug_class', 'varchar(50)', 'YES', '', None, ''),
 ('dosage', 'varchar(50)', 'YES', '', None, ''),
 ('route', "enum('Oral','IV','IM','Topical','Inhalation')", 'YES', '', None, ''),
 ('duration_days', 'int', 'YES', '', None, ''),
 ('start_date', 'date', 'YES', '', None, ''),
 ('end_date', 'date', 'YES', '', None, ''),
 ('prescriber', 'varchar(100)', 'YES', '', None, '')]

As we can see we don't have lincense number informations in medications table. The problem is, prescribers can have similar names and it would be difficult to attribute encounter or medications to the priscriber. Therefore, let's add lincense number column in medications

In [200]:
%%sql 
ALTER TABLE medications ADD COLUMN license_number VARCHAR(8); 

UPDATE medications m 
JOIN provider_information pi ON m.prescriber=pi.provider_name 
SET m.license_number = pi.license_number;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
3361 rows affected.

[]

In [202]:
# Let's check antibiotic prescription again
%sql SELECT license_number, prescriber, COUNT(*) as prescription_count FROM medications WHERE drug_class='Antibiotic' GROUP BY license_number, prescriber ORDER BY prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('RMDC2727', 'Dr. Uwamahoro', 82),
 ('RMDC6153', 'Dr. Kayitesi', 78),
 ('RMDC4131', 'Dr. Hakizimana', 75),
 ('RMDC1079', 'Dr. Mugisha', 73),
 ('RMDC7353', 'Dr. Mukamana', 72)]

In [4]:
# Let's review the tables 
%sql SHOW TABLES;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('clinical_encounter',),
 ('medications',),
 ('patient_demographics',),
 ('provider_information',),
 ('vitals_and_labs',)]

Now that we have all tables we need and that we have populated our databases with tables. I will be showcasing my sql skills from basic to advanced

# 3. Basic SQL (Foundations)

In [6]:
# Let's select first 10 patients from patient_demographics
%sql SELECT * FROM patient_demographics LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('00026B', 'Dustin Tate', 'Male', datetime.date(1991, 10, 20), 'Byumba', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('20.00'), 1),
 ('00156I', 'Andrea Taylor', 'Male', datetime.date(1977, 9, 3), 'Nyaruguru', 'High', 'CBHI', Decimal('20.00'), 48),
 ('00157V', 'Amy Ramirez', 'Male', datetime.date(1945, 11, 18), 'Cyangugu', 'Low', 'CBHI', Decimal('5.00'), 80),
 ('00178H', 'Peter Stuart', 'Male', datetime.date(1976, 6, 30), 'Byumba', 'High', 'Britam', Decimal('20.00'), 49),
 ('00250W', 'Amanda Wilson', 'Male', datetime.date(1992, 2, 12), 'Kibuye', 'High', 'MMI', Decimal('10.00'), 33),
 ('00266K', 'Cody Lloyd', 'Male', datetime.date(1944, 10, 13), 'Nyamagabe', 'Low', 'PIH', Decimal('5.00'), 81),
 ('00292K', 'Jason Silva', 'Male', datetime.date(1983, 12, 14), 'Muhanga', 'Low', 'Britam', Decimal('10.00'), 41),
 ('00305E', 'Aaron Newman', 'Female', datetime.date(1945, 2, 13), 'Ruhengeri', 'Low', 'CBHI', Decimal('20.00'), 80),
 ('00315K', 'Mark Davis', 'Male', datetime.date(1955, 6, 18), 'Gisenyi', 'Middle', 'PIH', Decimal('10.00'), 70)]

### Exercise 2: Select pid, name, sex from patient_demographics.

In [13]:
%sql SELECT pid, name, sex FROM patient_demographics LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin Tate', 'Male'),
 ('00146Z', 'Bethany Lara', 'Male'),
 ('00156I', 'Andrea Taylor', 'Male'),
 ('00157V', 'Amy Ramirez', 'Male'),
 ('00178H', 'Peter Stuart', 'Male')]

### Exercise 3: Count total patients in patient_demographics.

In [16]:
%sql SELECT COUNT(DISTINCT pid) FROM patient_demographics;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(2998,)]

This means that we have 2998 patients in our dataset

### Exercise 4: Count distinct values of sex in patient_demographics.

In [17]:
%sql SELECT COUNT(DISTINCT sex) FROM patient_demographics;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(2,)]

In [18]:
%sql SELECT DISTINCT(sex) from patient_demographics;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('Male',), ('Female',)]

We have two distinct sex in our dataset, and these are **Male**, and **Female**

### Exercise 5: List the first 10 patients ordered by name.

In [19]:
%sql SELECT * FROM patient_demographics ORDER BY name LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('16315Y', 'Aaron Benitez', 'Male', datetime.date(1986, 8, 25), 'Butare', 'Middle', 'Old Mutual', Decimal('10.00'), 39),
 ('18056X', 'Aaron Carroll', 'Female', datetime.date(2000, 10, 24), 'Kibungo', 'Middle', 'Radiant', Decimal('20.00'), 25),
 ('56956O', 'Aaron Garcia', 'Male', datetime.date(1944, 7, 14), 'Rwamagana', 'Low', 'PIH', Decimal('15.00'), 81),
 ('12977L', 'Aaron Hess', 'Female', datetime.date(1997, 5, 4), 'Muhanga', 'Low', 'Britam', Decimal('20.00'), 28),
 ('50877E', 'Aaron Lewis', 'Female', datetime.date(1977, 8, 23), 'Kamonyi', 'Middle', 'Old Mutual', Decimal('5.00'), 48),
 ('82491I', 'Aaron Martinez', 'Female', datetime.date(1971, 9, 2), 'Butare', 'Middle', 'Old Mutual', Decimal('5.00'), 54),
 ('00305E', 'Aaron Newman', 'Female', datetime.date(1945, 2, 13), 'Ruhengeri', 'Low', 'CBHI', Decimal('20.00'), 80),
 ('12162Z', 'Aaron Patterson', 'Male', datetime.date(1986, 10, 13), 'Butare', 'High', 'Radiant', Decimal('20.00'), 39),
 ('65717B', 'Aaron Shelton', 'Female', datetime.date(1995, 11, 20), 'Cyangugu', 'Low', 'CBHI', Decimal('20.00'), 30),
 ('57197A', 'Aaron Thomas', 'Female', datetime.date(1951, 8, 31), 'Gisenyi', 'Middle', 'Britam', Decimal('15.00'), 74)]

### Let's split name into first and last name

In [31]:
%%sql 
ALTER TABLE patient_demographics
ADD COLUMN first_name VARCHAR(100),
ADD COLUMN last_name VARCHAR(100);

ALTER TABLE patient_demographics
MODIFY COLUMN first_name VARCHAR(100) AFTER pid,
MODIFY COLUMN last_name VARCHAR(100) AFTER first_name;

UPDATE patient_demographics
SET first_name = SUBSTRING_INDEX(name, ' ', 1),
    last_name  = SUBSTRING_INDEX(name, ' ', -1);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.
2998 rows affected.

[]

In [32]:
%sql SELECT * FROM patient_demographics LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin', 'Tate', 'Dustin Tate', 'Male', datetime.date(1991, 10, 20), 'Byumba', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany', 'Lara', 'Bethany Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('20.00'), 1),
 ('00156I', 'Andrea', 'Taylor', 'Andrea Taylor', 'Male', datetime.date(1977, 9, 3), 'Nyaruguru', 'High', 'CBHI', Decimal('20.00'), 48),
 ('00157V', 'Amy', 'Ramirez', 'Amy Ramirez', 'Male', datetime.date(1945, 11, 18), 'Cyangugu', 'Low', 'CBHI', Decimal('5.00'), 80),
 ('00178H', 'Peter', 'Stuart', 'Peter Stuart', 'Male', datetime.date(1976, 6, 30), 'Byumba', 'High', 'Britam', Decimal('20.00'), 49)]

In [34]:
# Drop variable name
%sql ALTER TABLE patient_demographics DROP COLUMN name;

#Display 5 patients
%sql SELECT * FROM patient_demographics LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin', 'Tate', 'Male', datetime.date(1991, 10, 20), 'Byumba', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany', 'Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('20.00'), 1),
 ('00156I', 'Andrea', 'Taylor', 'Male', datetime.date(1977, 9, 3), 'Nyaruguru', 'High', 'CBHI', Decimal('20.00'), 48),
 ('00157V', 'Amy', 'Ramirez', 'Male', datetime.date(1945, 11, 18), 'Cyangugu', 'Low', 'CBHI', Decimal('5.00'), 80),
 ('00178H', 'Peter', 'Stuart', 'Male', datetime.date(1976, 6, 30), 'Byumba', 'High', 'Britam', Decimal('20.00'), 49)]

In [36]:
# Now let's list 10 patients ordered by last name again
%sql SELECT * FROM patient_demographics ORDER BY last_name LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('01258U', 'Stephen', 'Abbott', 'Female', datetime.date(1944, 7, 5), 'Nyanza', 'Low', 'Britam', Decimal('5.00'), 81),
 ('25367R', 'Keith', 'Abbott', 'Male', datetime.date(1953, 6, 10), 'Kibungo', 'Low', 'MMI', Decimal('10.00'), 72),
 ('25155K', 'Brandon', 'Acevedo', 'Female', datetime.date(1970, 11, 21), 'Cyangugu', 'High', 'None', Decimal('0.00'), 55),
 ('93773N', 'Jessica', 'Acosta', 'Female', datetime.date(1975, 6, 9), 'Cyangugu', 'Low', 'RSSB', Decimal('10.00'), 50),
 ('54814Y', 'Johnny', 'Acosta', 'Female', datetime.date(2014, 6, 14), 'Gisenyi', 'High', 'Britam', Decimal('5.00'), 11),
 ('36952E', 'Maria', 'Acosta', 'Female', datetime.date(1995, 3, 14), 'Nyanza', 'Low', 'PIH', Decimal('15.00'), 30),
 ('34134A', 'Joseph', 'Adams', 'Female', datetime.date(1996, 4, 2), 'Kayonza', 'Middle', 'CBHI', Decimal('20.00'), 29),
 ('57739T', 'Sarah', 'Adams', 'Female', datetime.date(1958, 1, 3), 'Kibungo', 'High', 'CBHI', Decimal('20.00'), 67),
 ('24618C', 'Christine', 'Adams', 'Male', datetime.date(1938, 8, 8), 'Butare', 'Middle', 'PIH', Decimal('5.00'), 87),
 ('16793L', 'Heidi', 'Adams', 'Female', datetime.date(2003, 7, 6), 'Kibungo', 'Middle', 'Britam', Decimal('20.00'), 22)]

In [59]:
# Let's adjust column name from insurance_coverage to copayment on table 'insurance_copayment'
%sql ALTER TABLE patient_demographics CHANGE COLUMN insurance_coverage copayment DECIMAL(5,2) NOT NULL;
%sql SELECT * FROM patient_demographics LIMIT 2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('00026B', 'Dustin', 'Tate', 'Male', datetime.date(1991, 10, 20), 'Gasabo', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany', 'Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('20.00'), 1)]

In [62]:
# Adjust copayment for RSSB to be 15% only
%sql UPDATE patient_demographics SET copayment=15 WHERE insurance_type='RSSB';
%sql SELECT DISTINCT(copayment) FROM patient_demographics WHERE insurance_type='RSSB';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
375 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(Decimal('15.00'),)]

### Exercise 6: List the last 10 patients ordered by dob descending.

In [37]:
%sql SELECT * FROM patient_demographics ORDER BY dob DESC LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('60226F', 'Jay', 'Mata', 'Female', datetime.date(2025, 11, 25), 'Kibuye', 'Middle', 'PIH', Decimal('10.00'), 0),
 ('55542D', 'Rachel', 'Guerrero', 'Male', datetime.date(2025, 11, 18), 'Kigali', 'Low', 'Old Mutual', Decimal('10.00'), 0),
 ('55516T', 'Cindy', 'Martin', 'Female', datetime.date(2025, 11, 8), 'Rwamagana', 'Middle', 'PIH', Decimal('10.00'), 0),
 ('20364Q', 'Beth', 'Perez', 'Female', datetime.date(2025, 10, 14), 'Kayonza', 'Low', 'PIH', Decimal('5.00'), 0),
 ('22633T', 'Bruce', 'Mcknight', 'Female', datetime.date(2025, 10, 9), 'Nyanza', 'High', 'Old Mutual', Decimal('15.00'), 0),
 ('71104A', 'Randy', 'Schmidt', 'Male', datetime.date(2025, 9, 29), 'Kibuye', 'Middle', 'PIH', Decimal('10.00'), 0),
 ('06382O', 'Sarah', 'Yang', 'Male', datetime.date(2025, 9, 26), 'Nyanza', 'Low', 'CBHI', Decimal('15.00'), 0),
 ('32871N', 'Meredith', 'Miller', 'Female', datetime.date(2025, 9, 16), 'Kibuye', 'Low', 'None', Decimal('0.00'), 0),
 ('46331Y', 'Jennifer', 'Bush', 'Female', datetime.date(2025, 9, 16), 'Kibungo', 'Low', 'MMI', Decimal('10.00'), 0),
 ('48208L', 'Matthew', 'Hernandez', 'Female', datetime.date(2025, 9, 10), 'Kamonyi', 'High', 'Britam', Decimal('20.00'), 0)]

### Exercise 7: Select patients where age >= 50.

In [38]:
%sql SELECT * FROM patient_demographics WHERE age >= 50 ORDER BY age LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('12492P', 'John', 'Hammond', 'Female', datetime.date(1975, 1, 22), 'Muhanga', 'Low', 'PIH', Decimal('5.00'), 50),
 ('09662E', 'Calvin', 'James', 'Male', datetime.date(1975, 6, 6), 'Muhanga', 'Middle', 'RSSB', Decimal('5.00'), 50),
 ('01947I', 'Harold', 'Bender', 'Male', datetime.date(1975, 4, 9), 'Nyaruguru', 'Middle', 'Old Mutual', Decimal('20.00'), 50),
 ('21807G', 'Amber', 'Buck', 'Male', datetime.date(1975, 11, 11), 'Kibungo', 'Low', 'None', Decimal('0.00'), 50),
 ('00366I', 'Nicholas', 'Gentry', 'Male', datetime.date(1975, 5, 30), 'Rwamagana', 'Middle', 'PIH', Decimal('10.00'), 50),
 ('12812O', 'Elizabeth', 'Baldwin', 'Female', datetime.date(1975, 11, 9), 'Muhanga', 'High', 'RSSB', Decimal('10.00'), 50),
 ('14893I', 'James', 'Baldwin', 'Male', datetime.date(1974, 12, 23), 'Gisenyi', 'High', 'Radiant', Decimal('15.00'), 50),
 ('21219V', 'Claudia', 'Wagner', 'Female', datetime.date(1975, 10, 25), 'Kigali', 'Low', 'RSSB', Decimal('15.00'), 50),
 ('18771H', 'Margaret', 'Craig', 'Female', datetime.date(1975, 4, 9), 'Cyangugu', 'Middle', 'PIH', Decimal('20.00'), 50),
 ('09176Z', 'Sherry', 'Miller', 'Male', datetime.date(1975, 10, 27), 'Cyangugu', 'Low', 'Radiant', Decimal('20.00'), 50)]

### Exercise 8: Insert a new patient row into patient_demographics.

In [41]:
%%sql 
INSERT INTO patient_demographics 
(pid, first_name, last_name, sex, dob, residence, ses, insurance_type, insurance_coverage, age) 
VALUES ('51354X', 'Eric', 'Garcia', 'Male', '1995-03-15', 'Gasabo', 'Middle', 'RSSB', 15.0, 30);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[]

### Exercise 9: Update residence for a specific pid in patient_demographics.

In [43]:
# Let's update first entry residence to Gasabo
%sql UPDATE patient_demographics SET residence = 'Gasabo' WHERE pid = '00026B'

# Display the first entry
%sql SELECT * FROM patient_demographics LIMIT 2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('00026B', 'Dustin', 'Tate', 'Male', datetime.date(1991, 10, 20), 'Gasabo', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany', 'Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('20.00'), 1)]

### Exercise 10: Delete a patient by pid from patient_demographics.

In [44]:
# Let's delete the entry we just created
%sql DELETE FROM patient_demographics WHERE pid = '51354X';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[]

### Exercise 11: Show all tables in the current database.

In [45]:
%sql SHOW tables

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('clinical_encounter',),
 ('medications',),
 ('patient_demographics',),
 ('provider_information',),
 ('vitals_and_labs',)]

### Exercise 12: Describe the structure of clinical_encounter.

In [46]:
%sql DESCRIBE clinical_encounter;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('encounter_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('pid', 'varchar(6)', 'NO', 'MUL', None, ''),
 ('encounter_date', 'date', 'NO', '', None, ''),
 ('encounter_type', "enum('Outpatient','Inpatient')", 'NO', '', None, ''),
 ('facility', 'varchar(100)', 'NO', '', None, ''),
 ('reason_for_visit', 'varchar(200)', 'YES', '', None, ''),
 ('diagnosis_code', 'varchar(20)', 'YES', '', None, ''),
 ('procedures', 'varchar(200)', 'YES', '', None, ''),
 ('outcome', "enum('Discharged','Admitted','Referred','Deceased')", 'YES', '', None, ''),
 ('followup_required', 'tinyint(1)', 'YES', '', None, '')]

### Exercise 13: Add a column email to provider_information.

In [48]:
# The column email is alread inserted
%sql SELECT * FROM provider_information LIMIT 2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('RMDC1079', 'Dr. Mugisha', 'Internal Medicine', 'Kibuye RH', '+250796987594', 'dr.mugisha@kibuyerh.rw'),
 ('RMDC2727', 'Dr. Uwamahoro', 'Surgery', 'CHUB', '+250790313569', 'dr.uwamahoro@chub.rw')]

### Exercise 17: Update route to 'Oral' where route is NULL in medications.

In [50]:
# First let's explore how many rows have empty medication route
%sql SELECT COUNT(*) FROM medications WHERE route IS NULL;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(0,)]

In [51]:
# This means that we don't have an empty medication route. 
# We would have replaced null as %sql UPDATE medications SET route = 'Oral' WHERE route IS NULL;

### Exercise 19: Delete medications where end_date < start_date (data cleanup).

In [54]:
%sql DELETE FROM medications WHERE end_date < start_date;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 20: Truncate a staging table (create and truncate a temp-like table).

In [56]:
# Copy the content of medications table
%sql CREATE TABLE medications_staging LIKE medications;

# Add some data in table
%sql INSERT INTO medications_staging (pid, diagnosis_code, drug_name, drug_class, dosage, route, duration_days, start_date, end_date, prescriber, license_number) VALUES ('00026B', 'I10', 'Amlodipine', 'Antihypertensive', '5mg', 'Oral', 30, '2025-01-01', '2025-01-31', 'Dr. Jean', 'LIC12345'), ('00027C', 'E11', 'Metformin', 'Antidiabetic', '500mg', 'Oral', 60, '2025-01-05', '2025-03-05', 'Dr. Alice', 'LIC67890');

# Truncate the staging table
%sql TRUNCATE TABLE medications_staging;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [57]:
# Let's review the content of medications_staging
%sql SELECT * FROM medications_staging;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

# 4. Filtering, sorting, grouping, and aggregates functions

### Exercise 21: Find distinct diagnosis_code values from clinical_encounter.

In [ ]:
# Let's first adapt diagnosis_code to be diagnosis (actual name) for easier readability
%sql SELECT DISTINCT(diagnosis_code)

In [58]:
%sql SELECT * FROM clinical_encounter LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(1, '65639B', datetime.date(2024, 12, 5), 'Outpatient', 'Kibuye RH', 'Routine Checkup', 'E11', 'Vaccination', 'Deceased', 0),
 (2, '66344D', datetime.date(2024, 10, 15), 'Inpatient', 'Kibungo RH', 'Screening', 'A09', 'Surgery', 'Admitted', 1),
 (3, '28988C', datetime.date(2025, 2, 12), 'Outpatient', 'CHUK', 'Headache', 'J10.1', 'MRI', 'Admitted', 1),
 (4, '50817R', datetime.date(2024, 4, 13), 'Outpatient', 'CHUB', 'Fever', 'A09', 'MRI', 'Discharged', 1),
 (5, '64615P', datetime.date(2025, 5, 17), 'Inpatient', 'CHUB', 'Screening', 'I10', 'CT Scan', 'Discharged', 1)]

In [63]:
%sql SELECT DISTINCT(diagnosis_code) FROM clinical_encounter;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('E11',), ('A09',), ('J10.1',), ('I10',), ('Z00.0',), ('S06.0',)]

In [64]:
%%sql 
CREATE TABLE diagnosis_dictionary (
    diagnosis_code VARCHAR(20) PRIMARY KEY,
    diagnosis_name VARCHAR(200) NOT NULL
);

INSERT INTO diagnosis_dictionary (diagnosis_code, diagnosis_name) VALUES
('E11', 'Type 2 diabetes mellitus'),
('A09', 'Infectious gastroenteritis and colitis, unspecified'),
('J10.1', 'Influenza due to other identified influenza virus with other respiratory manifestations'),
('I10', 'Essential (primary) hypertension'),
('Z00.0', 'Encounter for general adult medical examination'),
('S06.0', 'Concussion');

ALTER TABLE clinical_encounter
ADD COLUMN diagnosis_name VARCHAR(200);

ALTER TABLE medications
ADD COLUMN diagnosis_name VARCHAR(200);

UPDATE clinical_encounter ce
JOIN diagnosis_dictionary dd
  ON ce.diagnosis_code = dd.diagnosis_code
SET ce.diagnosis_name = dd.diagnosis_name;

UPDATE medications m
JOIN diagnosis_dictionary dd
  ON m.diagnosis_code = dd.diagnosis_code
SET m.diagnosis_name = dd.diagnosis_name;

SELECT * FROM clinical_encounter LIMIT 2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
6 rows affected.
0 rows affected.
0 rows affected.
3000 rows affected.
2651 rows affected.
2 rows affected.

[(1, '65639B', datetime.date(2024, 12, 5), 'Outpatient', 'Kibuye RH', 'Routine Checkup', 'E11', 'Vaccination', 'Deceased', 0, 'Type 2 diabetes mellitus'),
 (2, '66344D', datetime.date(2024, 10, 15), 'Inpatient', 'Kibungo RH', 'Screening', 'A09', 'Surgery', 'Admitted', 1, 'Infectious gastroenteritis and colitis, unspecified')]

In [65]:
# Now let's find the distinct diagnosis name in clinical_encounter
%sql SELECT DISTINCT(diagnosis_name) FROM clinical_encounter;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('Type 2 diabetes mellitus',),
 ('Infectious gastroenteritis and colitis, unspecified',),
 ('Influenza due to other identified influenza virus with other respiratory manifestations',),
 ('Essential (primary) hypertension',),
 ('Encounter for general adult medical examination',),
 ('Concussion',)]

### Exercise 22: Count encounters per diagnosis_name in clinical_encounter (GROUP BY).

In [69]:
%sql SELECT diagnosis_name, COUNT(*) AS encounter_count FROM clinical_encounter GROUP BY diagnosis_name ORDER BY encounter_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('Influenza due to other identified influenza virus with other respiratory manifestations', 547),
 ('Infectious gastroenteritis and colitis, unspecified', 506),
 ('Concussion', 495),
 ('Type 2 diabetes mellitus', 487),
 ('Essential (primary) hypertension', 486),
 ('Encounter for general adult medical examination', 479)]

### Exercise 23: Count encounters per facility in clinical_encounter.

In [70]:
%sql SELECT facility, COUNT(*) as patient_count FROM clinical_encounter GROUP BY facility ORDER BY patient_count;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('CHUB', 574),
 ('KMH', 598),
 ('Kibungo RH', 601),
 ('Kibuye RH', 605),
 ('CHUK', 622)]

### Exercise 24: Top 5 diagnosis_name by encounter_count.

In [71]:
%sql SELECT diagnosis_name, COUNT(*) AS diagnosis_count FROM clinical_encounter GROUP BY diagnosis_name ORDER BY diagnosis_count DESC LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('Influenza due to other identified influenza virus with other respiratory manifestations', 547),
 ('Infectious gastroenteritis and colitis, unspecified', 506),
 ('Concussion', 495),
 ('Type 2 diabetes mellitus', 487),
 ('Essential (primary) hypertension', 486)]

### Exercise 25: Count encounters per outcome (Discharged/Admitted/Referred/Deceased).

In [72]:
%sql SELECT outcome, COUNT(*) as patient_count FROM clinical_encounter GROUP BY outcome ORDER BY patient_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
4 rows affected.

[('Discharged', 785), ('Referred', 743), ('Admitted', 740), ('Deceased', 732)]

### Exercise 26: Filter encounters between two dates using BETWEEN on encounter_date.

In [74]:
%sql SELECT encounter_id, pid, diagnosis_name, encounter_date, facility FROM clinical_encounter WHERE encounter_date BETWEEN '2025-01-01' AND '2025-01-05' ORDER BY encounter_date;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
14 rows affected.

[(1401, '91486D', 'Influenza due to other identified influenza virus with other respiratory manifestations', datetime.date(2025, 1, 1), 'CHUB'),
 (2785, '75357F', 'Encounter for general adult medical examination', datetime.date(2025, 1, 1), 'KMH'),
 (381, '86035N', 'Influenza due to other identified influenza virus with other respiratory manifestations', datetime.date(2025, 1, 2), 'CHUB'),
 (1663, '28085I', 'Type 2 diabetes mellitus', datetime.date(2025, 1, 2), 'KMH'),
 (2069, '88323R', 'Infectious gastroenteritis and colitis, unspecified', datetime.date(2025, 1, 2), 'KMH'),
 (1855, '07442X', 'Infectious gastroenteritis and colitis, unspecified', datetime.date(2025, 1, 3), 'CHUB'),
 (2965, '84949T', 'Essential (primary) hypertension', datetime.date(2025, 1, 3), 'CHUB'),
 (644, '48183Z', 'Concussion', datetime.date(2025, 1, 4), 'CHUK'),
 (1015, '90696T', 'Type 2 diabetes mellitus', datetime.date(2025, 1, 4), 'Kibungo RH'),
 (1187, '01850H', 'Infectious gastroenteritis and colitis, unspecified', datetime.date(2025, 1, 4), 'CHUK'),
 (1650, '88430G', 'Concussion', datetime.date(2025, 1, 4), 'Kibuye RH'),
 (2663, '47537V', 'Type 2 diabetes mellitus', datetime.date(2025, 1, 4), 'Kibungo RH'),
 (2707, '00266K', 'Encounter for general adult medical examination', datetime.date(2025, 1, 4), 'CHUB'),
 (1893, '99374I', 'Encounter for general adult medical examination', datetime.date(2025, 1, 5), 'CHUK')]

In [76]:
%sql UPDATE clinical_encounter SET facility='RMH' WHERE facility='KMH';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
598 rows affected.

[]

In [77]:
%sql SELECT encounter_id, pid, diagnosis_name, encounter_date, facility FROM clinical_encounter WHERE encounter_date BETWEEN '2025-01-01' AND '2025-01-05' ORDER BY encounter_date;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
14 rows affected.

[(1401, '91486D', 'Influenza due to other identified influenza virus with other respiratory manifestations', datetime.date(2025, 1, 1), 'CHUB'),
 (2785, '75357F', 'Encounter for general adult medical examination', datetime.date(2025, 1, 1), 'RMH'),
 (381, '86035N', 'Influenza due to other identified influenza virus with other respiratory manifestations', datetime.date(2025, 1, 2), 'CHUB'),
 (1663, '28085I', 'Type 2 diabetes mellitus', datetime.date(2025, 1, 2), 'RMH'),
 (2069, '88323R', 'Infectious gastroenteritis and colitis, unspecified', datetime.date(2025, 1, 2), 'RMH'),
 (1855, '07442X', 'Infectious gastroenteritis and colitis, unspecified', datetime.date(2025, 1, 3), 'CHUB'),
 (2965, '84949T', 'Essential (primary) hypertension', datetime.date(2025, 1, 3), 'CHUB'),
 (644, '48183Z', 'Concussion', datetime.date(2025, 1, 4), 'CHUK'),
 (1015, '90696T', 'Type 2 diabetes mellitus', datetime.date(2025, 1, 4), 'Kibungo RH'),
 (1187, '01850H', 'Infectious gastroenteritis and colitis, unspecified', datetime.date(2025, 1, 4), 'CHUK'),
 (1650, '88430G', 'Concussion', datetime.date(2025, 1, 4), 'Kibuye RH'),
 (2663, '47537V', 'Type 2 diabetes mellitus', datetime.date(2025, 1, 4), 'Kibungo RH'),
 (2707, '00266K', 'Encounter for general adult medical examination', datetime.date(2025, 1, 4), 'CHUB'),
 (1893, '99374I', 'Encounter for general adult medical examination', datetime.date(2025, 1, 5), 'CHUK')]

### Exercise 27: Find encounters where followup_required = 1.

In [78]:
%sql SELECT followup_required, COUNT(*) as count FROM clinical_encounter WHERE followup_required=1;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(1, 1486)]

### Exercise 28: Use LIKE to find patient names starting with 'Jos' in patient_demographics

In [84]:
%sql SELECT first_name, COUNT(*) AS count FROM patient_demographics WHERE first_name LIKE 'Jos%' GROUP BY first_name ORDER BY COUNT;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[('Jose', 10), ('Joshua', 25), ('Joseph', 30)]

### Exercise 29: Use IN to filter diagnosis_code among a set (e.g., 'I10','E11','A09').

In [87]:
%sql SELECT diagnosis_name, COUNT(*) AS count FROM clinical_encounter WHERE diagnosis_code IN ('I10', 'E11', 'A09') GROUP BY diagnosis_name ORDER BY count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[('Infectious gastroenteritis and colitis, unspecified', 506),
 ('Type 2 diabetes mellitus', 487),
 ('Essential (primary) hypertension', 486)]

### Exercise 30: Order medications by start_date descending.

In [88]:
%sql SELECT * FROM medications ORDER BY start_date DESC LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(1, '65639B', 'I10', 'Amlodipine', 'Antihypertensive', '5 mg daily', 'Oral', 30, datetime.date(2024, 11, 18), datetime.date(2024, 12, 18), 'Dr. Mugisha', 'RMDC1079', 'Essential (primary) hypertension'),
 (2, '28988C', 'B20', 'Tenofovir', 'Antiretroviral', '300 mg daily', 'Oral', 30, datetime.date(2024, 11, 18), datetime.date(2024, 12, 18), 'Dr. Hakizimana', 'RMDC4131', None),
 (3, '50817R', 'J10.1', 'Oseltamivir', 'Antiviral', '75 mg twice daily', 'Oral', 5, datetime.date(2024, 11, 18), datetime.date(2024, 11, 23), 'Dr. Ndahiro', 'RMDC3353', 'Influenza due to other identified influenza virus with other respiratory manifestations'),
 (4, '50817R', 'J10.1', 'Paracetamol', 'Analgesic', '500 mg every 6h', 'Oral', 5, datetime.date(2024, 11, 18), datetime.date(2024, 11, 23), 'Dr. Ndahiro', 'RMDC3353', 'Influenza due to other identified influenza virus with other respiratory manifestations'),
 (5, '64615P', 'I10', 'Amlodipine', 'Antihypertensive', '5 mg daily', 'Oral', 30, datetime.date(2024, 11, 18), datetime.date(2024, 12, 18), 'Dr. Mukamana', 'RMDC7353', 'Essential (primary) hypertension')]

### Exercise 31: Calculate average duration_days per drug_class.

In [91]:
%%sql 
SELECT drug_class, AVG(DATEDIFF(end_date, start_date)) 
AS avg_duration_days 
FROM medications 
WHERE end_date IS NOT NUll 
AND start_date IS NOT NULL 
AND end_date>=start_date 
GROUP BY drug_class 
ORDER BY avg_duration_days;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[('Antimalarial', Decimal('3.0000')),
 ('Rehydration', Decimal('3.0000')),
 ('Antiviral', Decimal('5.0000')),
 ('Analgesic', Decimal('6.0688')),
 ('Antibiotic', Decimal('7.0000')),
 ('Antihypertensive', Decimal('30.0000')),
 ('Antiretroviral', Decimal('30.0000')),
 ('Antidiabetic', Decimal('30.0000'))]

### Exercise 32: Find min and max temperature from vitals_and_labs.

In [93]:
%sql SELECT MIN(temperature) AS min_temp, MAX(temperature) AS max_temp FROM vitals_and_labs;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(Decimal('36.0'), Decimal('40.0'))]

### Exercise 33: Summary statistics of diastolic and systolic blood pressure

In [96]:
%%sql 
SELECT 
COUNT(pid) AS patient_count, 
AVG(bp_systole) AS mean_systole, 
STDDEV(bp_systole) AS std_systole, 
MIN(bp_systole) AS min_systole, 
MAX(bp_systole) AS max_systole 
FROM vitals_and_labs;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(3000, Decimal('140.2297'), 23.553066040091014, 100, 180)]

In [98]:
%%sql 
SELECT 
COUNT(pid) AS patient_count, 
AVG(bp_diastole) AS mean_diastole, 
STDDEV(bp_diastole) AS std_diastole, 
MIN(bp_diastole) AS min_diastole, 
MAX(bp_diastole) AS max_diastole 
FROM vitals_and_labs;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(3000, Decimal('84.7833'), 14.645353832833433, 60, 110)]

### Exercise 34: Round average BMI to 1 decimal place.

In [101]:
%sql SELECT ROUND(AVG(BMI),1) AS avg_bmi FROM vitals_and_labs;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(Decimal('23.8'),)]

### Exercise 35: Count prescriptions per route in medications.

In [103]:
%sql SELECT route, COUNT(*) AS count FROM medications GROUP BY route ORDER by count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[('Oral', 3361)]

### Exercise 36: Group vitals_and_labs by lab_result_flag and count rows.

In [106]:
%sql SELECT lab_result_flag, COUNT(lab_result_flag) AS count FROM vitals_and_labs GROUP BY lab_result_flag ORDER BY count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[('Normal', 1258), ('Critical', 1176), ('Abnormal', 566)]

### Exercise 37: Group clinical_encounter by encounter_type and count rows.

In [107]:
%sql SELECT encounter_type, COUNT(*) AS count FROM clinical_encounter GROUP BY encounter_type ORDER BY count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('Inpatient', 1592), ('Outpatient', 1408)]

### Exercise 38: Use YEAR to count encounters per year.

In [108]:
%sql SELECT YEAR(encounter_date) AS encounter_year, COUNT(*) AS encounter_count FROM clinical_encounter WHERE encounter_date IS NOT NULL GROUP BY YEAR(encounter_date) ORDER BY encounter_year;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[(2023, 139), (2024, 1462), (2025, 1399)]

### Exercise 39: Use MONTH to count medications started per month.

In [121]:
%sql SELECT MONTH(start_date) AS month, COUNT(*) AS count FROM medications GROUP BY MONTH(start_date) ORDER BY month;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
12 rows affected.

[(1, 256),
 (2, 266),
 (3, 264),
 (4, 292),
 (5, 275),
 (6, 286),
 (7, 316),
 (8, 305),
 (9, 248),
 (10, 269),
 (11, 302),
 (12, 282)]

### Exercise 40: Use DAYOFWEEK to count encounters by weekday.

In [123]:
%sql SELECT DAYOFWEEK(encounter_date) AS DayOfWeek, COUNT(*) AS count FROM clinical_encounter GROUP BY DAYOFWEEK(encounter_date) ORDER BY DayOfWeek;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
7 rows affected.

[(1, 412), (2, 431), (3, 441), (4, 423), (5, 411), (6, 441), (7, 441)]

### Exercise 41: Use CONCAT to format name (pid) from patient_demographics.

In [125]:
%sql SELECT CONCAT(first_name, ' ', last_name, '(', pid, ')') AS patient_label FROM patient_demographics ORDER BY first_name LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('Aaron Newman(00305E)',),
 ('Aaron Benitez(16315Y)',),
 ('Aaron Woods(06884F)',),
 ('Aaron Hess(12977L)',),
 ('Aaron Patterson(12162Z)',)]

### Exercise 42: Use SUBSTRING to extract first three letters of provider_name.

In [128]:
%sql SELECT provider_name, SUBSTRING(provider_name, 5, 3) AS provider_code FROM provider_information;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
15 rows affected.

[('Dr. Mugisha', 'Mug'),
 ('Dr. Uwamahoro', 'Uwa'),
 ('Dr. Ndahiro', 'Nda'),
 ('Dr. Hakizimana', 'Hak'),
 ('Dr. Ndahiro', 'Nda'),
 ('Dr. Umutoni', 'Umu'),
 ('Dr. Kayitesi', 'Kay'),
 ('Dr. Aline', 'Ali'),
 ('Dr. Uwamahoro', 'Uwa'),
 ('Dr. Nkurunziza', 'Nku'),
 ('Dr. Mukamana', 'Muk'),
 ('Dr. Uwase', 'Uwa'),
 ('Dr. Uwimana', 'Uwi'),
 ('Dr. Umutoni', 'Umu'),
 ('Dr. Leandre', 'Lea')]

### Exercise 43: Use LENGTH to find longest patient name.

In [130]:
%sql SELECT first_name, LENGTH(first_name) AS name_length FROM patient_demographics ORDER BY name_length DESC LIMIT 1;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[('Christopher', 11)]

### Exercise 44: Uppercase provider_name values (display only with UCASE/LCASE).

In [133]:
%sql SELECT UPPER(first_name), UPPER(last_name) FROM patient_demographics LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('DUSTIN', 'TATE'),
 ('BETHANY', 'LARA'),
 ('ANDREA', 'TAYLOR'),
 ('AMY', 'RAMIREZ'),
 ('PETER', 'STUART')]

### Exercise 45: Find patients where insurance_type = 'None' and copayment = 0.

In [136]:
%sql UPDATE patient_demographics SET copayment=100 WHERE insurance_type='None';
%sql SELECT * FROM patient_demographics WHERE insurance_type = 'None' LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
411 rows affected.
 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00937I', 'Steven', 'Klein', 'Male', datetime.date(1970, 9, 5), 'Kamonyi', 'Low', 'None', Decimal('100.00'), 55),
 ('00965S', 'Chelsea', 'Moses', 'Female', datetime.date(2006, 6, 15), 'Kigali', 'High', 'None', Decimal('100.00'), 19),
 ('01002Z', 'Lisa', 'Frazier', 'Female', datetime.date(1992, 8, 13), 'Rwamagana', 'Low', 'None', Decimal('100.00'), 33),
 ('01033V', 'Jared', 'MD', 'Female', datetime.date(1997, 7, 18), 'Nyaruguru', 'High', 'None', Decimal('100.00'), 28),
 ('01126C', 'Kristi', 'Davis', 'Female', datetime.date(1999, 2, 15), 'Nyanza', 'Low', 'None', Decimal('100.00'), 26)]

### Exercise 47: Patients with more than 3 encounters (HAVING COUNT(*) > 3).

In [137]:
%sql SELECT pid, COUNT(*) AS count FROM clinical_encounter GROUP BY pid HAVING COUNT(*)>3 ORDER BY count;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 48: Prescribers with more than 100 prescriptions (GROUP BY prescriber HAVING).

In [140]:
%sql SELECT m.license_number, p.speciality, m.prescriber, COUNT(*) AS NumberOfPrescription FROM medications m JOIN provider_information p ON m.license_number=p.license_number GROUP BY m.license_number, p.speciality, m.prescriber HAVING COUNT(*)>100 ORDER BY NumberOfPrescription DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
9 rows affected.

[('RMDC2727', 'Surgery', 'Dr. Uwamahoro', 559),
 ('RMDC6153', 'Internal Medicine', 'Dr. Kayitesi', 472),
 ('RMDC1079', 'Internal Medicine', 'Dr. Mugisha', 453),
 ('RMDC7353', 'Internal Medicine', 'Dr. Mukamana', 440),
 ('RMDC4131', 'Internal Medicine', 'Dr. Hakizimana', 415),
 ('RMDC3353', 'Emergency', 'Dr. Ndahiro', 314),
 ('RMDC6075', 'Surgery', 'Dr. Umutoni', 221),
 ('RMDC9608', 'Emergency', 'Dr. Leandre', 138),
 ('RMDC6495', 'Emergency', 'Dr. Aline', 116)]

### Exercise 50: Patients with encounter_count above the overall average (subquery).

In [141]:
%%sql 
SELECT 
    e.pid,
    p.first_name,
    p.last_name,
    COUNT(*) AS encounter_count
FROM clinical_encounter e
JOIN patient_demographics p 
    ON e.pid = p.pid
GROUP BY e.pid, p.first_name, p.last_name
HAVING COUNT(*) > (
    SELECT AVG(encounter_count)
    FROM (
        SELECT COUNT(*) AS encounter_count
        FROM clinical_encounter
        GROUP BY pid
    ) AS sub
)
ORDER BY encounter_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('84591Q', 'Amy', 'Craig', 2), ('91820L', 'Michael', 'Horton', 2)]

# 5. Joins across tables

### Exercise 51: Join clinical_encounter to patient_demographics by pid and list name, encounter_date, diagnosis_name.

In [143]:
%sql SELECT p.pid, p.first_name, p.last_name, c.encounter_date, c.diagnosis_name FROM patient_demographics p JOIN clinical_encounter c ON p.pid=c.pid LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin', 'Tate', datetime.date(2025, 7, 1), 'Type 2 diabetes mellitus'),
 ('00146Z', 'Bethany', 'Lara', datetime.date(2024, 4, 12), 'Influenza due to other identified influenza virus with other respiratory manifestations'),
 ('00156I', 'Andrea', 'Taylor', datetime.date(2025, 9, 12), 'Infectious gastroenteritis and colitis, unspecified'),
 ('00157V', 'Amy', 'Ramirez', datetime.date(2025, 4, 23), 'Infectious gastroenteritis and colitis, unspecified'),
 ('00178H', 'Peter', 'Stuart', datetime.date(2025, 2, 27), 'Concussion')]

### Exercise 52: Join medications to patient_demographics by pid and list name, drug_name, start_date.

In [146]:
%sql SELECT p.pid, p.first_name, p.last_name, m.diagnosis_name, m.drug_name, m.start_date FROM patient_demographics p JOIN medications m ON p.pid=m.pid LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin', 'Tate', None, 'Tenofovir', datetime.date(2025, 7, 1)),
 ('00146Z', 'Bethany', 'Lara', None, 'Tenofovir', datetime.date(2024, 4, 12)),
 ('00156I', 'Andrea', 'Taylor', 'Influenza due to other identified influenza virus with other respiratory manifestations', 'Oseltamivir', datetime.date(2025, 9, 12)),
 ('00156I', 'Andrea', 'Taylor', 'Influenza due to other identified influenza virus with other respiratory manifestations', 'Paracetamol', datetime.date(2025, 9, 12)),
 ('00157V', 'Amy', 'Ramirez', 'Concussion', 'Paracetamol', datetime.date(2025, 4, 23))]

### Exercise 53: Join medications to provider_information by license_number to list prescriber, speciality, drug_name.

In [148]:
%sql SELECT p.license_number, p.provider_name, p.speciality, c.diagnosis_name, m.drug_name FROM medications m JOIN provider_information p ON m.license_number=p.license_number JOIN clinical_encounter c ON m.pid=c.pid LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('RMDC1079', 'Dr. Mugisha', 'Internal Medicine', 'Type 2 diabetes mellitus', 'Amlodipine'),
 ('RMDC4131', 'Dr. Hakizimana', 'Internal Medicine', 'Influenza due to other identified influenza virus with other respiratory manifestations', 'Tenofovir'),
 ('RMDC3353', 'Dr. Ndahiro', 'Emergency', 'Infectious gastroenteritis and colitis, unspecified', 'Oseltamivir'),
 ('RMDC3353', 'Dr. Ndahiro', 'Emergency', 'Infectious gastroenteritis and colitis, unspecified', 'Paracetamol'),
 ('RMDC7353', 'Dr. Mukamana', 'Internal Medicine', 'Essential (primary) hypertension', 'Amlodipine')]

In [150]:
%sql SHOW TABLES;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[('clinical_encounter',),
 ('diagnosis_dictionary',),
 ('medication_staging',),
 ('medications',),
 ('medications_staging',),
 ('patient_demographics',),
 ('provider_information',),
 ('vitals_and_labs',)]

In [151]:
%sql SELECT * FROM diagnosis_dictionary;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('A09', 'Infectious gastroenteritis and colitis, unspecified'),
 ('E11', 'Type 2 diabetes mellitus'),
 ('I10', 'Essential (primary) hypertension'),
 ('J10.1', 'Influenza due to other identified influenza virus with other respiratory manifestations'),
 ('S06.0', 'Concussion'),
 ('Z00.0', 'Encounter for general adult medical examination')]

In [152]:
# It seems two diagnosis are missing, let's update the entire dictionary

In [153]:
%%sql 
-- First, update existing codes with correct names
UPDATE diagnosis_dictionary 
SET diagnosis_name = 'Infectious gastroenteritis and colitis, unspecified'
WHERE diagnosis_code = 'A09';

UPDATE diagnosis_dictionary 
SET diagnosis_name = 'Type 2 diabetes mellitus'
WHERE diagnosis_code = 'E11';

UPDATE diagnosis_dictionary 
SET diagnosis_name = 'Essential (primary) hypertension'
WHERE diagnosis_code = 'I10';

UPDATE diagnosis_dictionary 
SET diagnosis_name = 'Influenza due to other identified influenza virus with other respiratory manifestations'
WHERE diagnosis_code = 'J10.1';

UPDATE diagnosis_dictionary 
SET diagnosis_name = 'Concussion'
WHERE diagnosis_code = 'S06.0';

UPDATE diagnosis_dictionary 
SET diagnosis_name = 'Encounter for general adult medical examination'
WHERE diagnosis_code = 'Z00.0';

-- Now insert missing codes if they dont already exist
INSERT INTO diagnosis_dictionary (diagnosis_code, diagnosis_name)
SELECT 'B20', 'HIV disease'
WHERE NOT EXISTS (SELECT 1 FROM diagnosis_dictionary WHERE diagnosis_code = 'B20');

INSERT INTO diagnosis_dictionary (diagnosis_code, diagnosis_name)
SELECT 'B50', 'Plasmodium falciparum malaria'
WHERE NOT EXISTS (SELECT 1 FROM diagnosis_dictionary WHERE diagnosis_code = 'B50');

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [155]:
%%sql 
-- Let's update other tables 
UPDATE clinical_encounter ce
JOIN diagnosis_dictionary dd
  ON ce.diagnosis_code = dd.diagnosis_code
SET ce.diagnosis_name = dd.diagnosis_name;

UPDATE medications m
JOIN diagnosis_dictionary dd
  ON m.diagnosis_code = dd.diagnosis_code
SET m.diagnosis_name = dd.diagnosis_name;

SELECT * FROM clinical_encounter LIMIT 2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3000 rows affected.
3361 rows affected.
2 rows affected.

[(1, '65639B', datetime.date(2024, 12, 5), 'Outpatient', 'Kibuye RH', 'Routine Checkup', 'E11', 'Vaccination', 'Deceased', 0, 'Type 2 diabetes mellitus'),
 (2, '66344D', datetime.date(2024, 10, 15), 'Inpatient', 'Kibungo RH', 'Screening', 'A09', 'Surgery', 'Admitted', 1, 'Infectious gastroenteritis and colitis, unspecified')]

In [156]:
# Now let's rerun the code for our exercise
%sql SELECT p.license_number, p.provider_name, p.speciality, c.diagnosis_name, m.drug_name FROM medications m JOIN provider_information p ON m.license_number=p.license_number JOIN clinical_encounter c ON m.pid=c.pid LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('RMDC1079', 'Dr. Mugisha', 'Internal Medicine', 'Type 2 diabetes mellitus', 'Amlodipine'),
 ('RMDC4131', 'Dr. Hakizimana', 'Internal Medicine', 'Influenza due to other identified influenza virus with other respiratory manifestations', 'Tenofovir'),
 ('RMDC3353', 'Dr. Ndahiro', 'Emergency', 'Infectious gastroenteritis and colitis, unspecified', 'Oseltamivir'),
 ('RMDC3353', 'Dr. Ndahiro', 'Emergency', 'Infectious gastroenteritis and colitis, unspecified', 'Paracetamol'),
 ('RMDC7353', 'Dr. Mukamana', 'Internal Medicine', 'Essential (primary) hypertension', 'Amlodipine')]

### Exercise 54: Join clinical_encounter to provider_information by facility to list facility diagnosis distribution.

In [161]:
%%sql 
SELECT ce.diagnosis_name, pi.facility, COUNT(*) 
AS diagnosis_count FROM clinical_encounter ce 
JOIN provider_information pi ON ce.facility=pi.facility 
GROUP BY ce.diagnosis_name, pi.facility 
ORDER BY ce.diagnosis_name, diagnosis_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
24 rows affected.

[('Concussion', 'Kibuye RH', 315),
 ('Concussion', 'CHUK', 306),
 ('Concussion', 'CHUB', 279),
 ('Concussion', 'Kibungo RH', 267),
 ('Encounter for general adult medical examination', 'Kibungo RH', 324),
 ('Encounter for general adult medical examination', 'CHUK', 297),
 ('Encounter for general adult medical examination', 'Kibuye RH', 285),
 ('Encounter for general adult medical examination', 'CHUB', 276),
 ('Essential (primary) hypertension', 'Kibungo RH', 297),
 ('Essential (primary) hypertension', 'CHUB', 285),
 ('Essential (primary) hypertension', 'CHUK', 285),
 ('Essential (primary) hypertension', 'Kibuye RH', 282),
 ('Infectious gastroenteritis and colitis, unspecified', 'Kibuye RH', 312),
 ('Infectious gastroenteritis and colitis, unspecified', 'CHUK', 309),
 ('Infectious gastroenteritis and colitis, unspecified', 'Kibungo RH', 303),
 ('Infectious gastroenteritis and colitis, unspecified', 'CHUB', 303),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'CHUK', 363),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'CHUB', 315),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Kibuye RH', 306),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Kibungo RH', 306),
 ('Type 2 diabetes mellitus', 'Kibuye RH', 315),
 ('Type 2 diabetes mellitus', 'CHUK', 306),
 ('Type 2 diabetes mellitus', 'Kibungo RH', 306),
 ('Type 2 diabetes mellitus', 'CHUB', 264)]

### Exercise 55: Join vitals_and_labs to patient_demographics by pid and list latest vitals per patient.

In [164]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, vl.collection_date, 
vl.bp_systole, vl.bp_diastole, vl.heart_rate, vl.respiratory_rate, 
vl.temperature, vl.oxygen_saturation, vl.height, vl.weight, 
vl.BMI, vl.lab_test_name, vl.lab_result_value, vl.lab_result_unit, vl.lab_result_flag 
FROM patient_demographics pd 
JOIN vitals_and_labs vl ON pd.pid=vl.pid 
ORDER BY vl.collection_date DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('80446D', 'Cameron', 'Erickson', datetime.date(2025, 11, 30), 178, 88, 84, 17, Decimal('37.4'), 95, Decimal('187.50'), Decimal('68.40'), Decimal('19.50'), 'Malaria RDT', 'Negative', '', 'Normal'),
 ('00391J', 'Sheila', 'Stewart', datetime.date(2025, 11, 29), 137, 70, 93, 20, Decimal('37.2'), 99, Decimal('175.00'), Decimal('47.80'), Decimal('15.60'), 'Hemoglobin', '13.3', 'g/dL', 'Normal'),
 ('40573L', 'Thomas', 'MD', datetime.date(2025, 11, 29), 102, 60, 79, 19, Decimal('38.7'), 100, Decimal('158.80'), Decimal('57.70'), Decimal('22.90'), 'HIV Test', 'Positive', '', 'Critical'),
 ('24650U', 'Jordan', 'Mosley', datetime.date(2025, 11, 28), 160, 76, 97, 14, Decimal('36.2'), 94, Decimal('176.30'), Decimal('51.00'), Decimal('16.40'), 'Hemoglobin', '13.8', 'g/dL', 'Normal'),
 ('33005P', 'Steven', 'Villanueva', datetime.date(2025, 11, 28), 168, 65, 69, 15, Decimal('38.1'), 95, Decimal('178.90'), Decimal('71.40'), Decimal('22.30'), 'Glucosemia', '5.3', 'mmol/L', 'Normal')]

### Exercise 56: Left join patients with clinical_encounter to find patients without encounters.

In [165]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name 
FROM patient_demographics pd 
LEFT JOIN clinical_encounter ce 
ON pd.pid=ce.pid 
WHERE ce.pid IS NULL;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 57: Left join patients with medications to find patients without medications.

In [167]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name 
FROM patient_demographics pd 
LEFT JOIN medications m 
ON pd.pid=m.pid 
WHERE m.pid IS NULL 
LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('00412N', 'Eric', 'Miller'),
 ('00493W', 'Donna', 'Johnston'),
 ('00576M', 'Robert', 'Gray'),
 ('00937I', 'Steven', 'Klein'),
 ('01100P', 'Daniel', 'Robinson'),
 ('01419I', 'Erik', 'Anderson'),
 ('01804S', 'Ryan', 'Bradley'),
 ('01877R', 'Patrick', 'King'),
 ('02337L', 'Joanna', 'White'),
 ('02402N', 'Tom', 'Howard')]

In [170]:
%%sql 
SELECT COUNT(*) AS PatientsNotGivenMedications FROM (SELECT pd.pid, pd.first_name, pd.last_name 
FROM patient_demographics pd 
LEFT JOIN medications m 
ON pd.pid=m.pid 
WHERE m.pid IS NULL) AS sub;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(371,)]

### Exercise 58: Join clinical_encounter and medications on pid and closest date within 7 days (using date difference; showcase logic).

In [173]:
%%sql 
SELECT ce.pid, ce.encounter_date, ce.diagnosis_code, m.end_date, 
ABS(DATEDIFF(m.end_date, ce.encounter_date)) AS day_diff 
FROM clinical_encounter ce 
JOIN medications m 
ON ce.pid=m.pid 
WHERE ABS(DATEDIFF(m.end_date, ce.encounter_date))<=7 
ORDER BY day_diff 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('81629X', datetime.date(2024, 11, 20), 'Z00.0', datetime.date(2024, 11, 21), 1),
 ('29706B', datetime.date(2024, 11, 20), 'J10.1', datetime.date(2024, 11, 21), 1),
 ('55612C', datetime.date(2024, 11, 19), 'J10.1', datetime.date(2024, 11, 21), 2),
 ('62269E', datetime.date(2024, 7, 24), 'E11', datetime.date(2024, 7, 27), 3),
 ('26800B', datetime.date(2025, 6, 22), 'E11', datetime.date(2025, 6, 25), 3)]

### Exercise 59: Join clinical_encounter to provider_information to count encounters per speciality.

In [175]:
%%sql 
SELECT pi.speciality, COUNT(*) AS encounter_count 
FROM clinical_encounter ce 
JOIN medications m ON ce.pid=m.pid 
JOIN provider_information pi ON m.license_number=pi.license_number 
GROUP BY pi.speciality 
ORDER BY encounter_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[('Internal Medicine', 1784), ('Surgery', 1015), ('Emergency', 568)]

### Exercise 60: Join medications to provider_information to count prescriptions per facility.

In [178]:
%%sql 
SELECT pi.facility, COUNT(m.drug_name) AS prescription_count 
FROM medications m 
JOIN provider_information pi ON m.license_number=pi.license_number 
GROUP BY pi.facility 
ORDER BY prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('CHUB', 1115),
 ('Kibuye RH', 681),
 ('Kibungo RH', 636),
 ('CHUK', 546),
 ('KMH', 383)]

# 6. Antibiotics and prescriber analytics

### Exercise 61: Distinct prescribers who prescribed antibiotics (drug_class = 'Antibiotic').

In [184]:
%%sql 
SELECT DISTINCT pi.provider_name AS PrescriberOfAntibiotics, pi.speciality, 
m.license_number FROM provider_information pi 
JOIN medications m ON pi.license_number=m.license_number 
WHERE m.drug_class='Antibiotic';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('Dr. Mukamana', 'Internal Medicine', 'RMDC7353'),
 ('Dr. Hakizimana', 'Internal Medicine', 'RMDC4131'),
 ('Dr. Mugisha', 'Internal Medicine', 'RMDC1079'),
 ('Dr. Kayitesi', 'Internal Medicine', 'RMDC6153'),
 ('Dr. Uwamahoro', 'Surgery', 'RMDC2727')]

### Exercise 62: Count antibiotic prescriptions per prescriber (GROUP BY prescriber).

In [189]:
%%sql 
SELECT pi.license_number,
       pi.provider_name,
       pi.speciality,
       COUNT(*) AS prescription_count
FROM provider_information pi
JOIN medications m ON pi.license_number = m.license_number
WHERE m.drug_class = 'Antibiotic'
GROUP BY pi.license_number, pi.provider_name, pi.speciality
ORDER BY prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('RMDC2727', 'Dr. Uwamahoro', 'Surgery', 82),
 ('RMDC6153', 'Dr. Kayitesi', 'Internal Medicine', 78),
 ('RMDC4131', 'Dr. Hakizimana', 'Internal Medicine', 75),
 ('RMDC1079', 'Dr. Mugisha', 'Internal Medicine', 73),
 ('RMDC7353', 'Dr. Mukamana', 'Internal Medicine', 72)]

### Exercise 65: Count antibiotic prescriptions per speciality (join with provider_information).

In [192]:
%%sql 
SELECT pi.speciality, COUNT(m.drug_class) AS prescription_count 
FROM medications m 
JOIN provider_information pi ON m.license_number=pi.license_number 
WHERE m.drug_class='Antibiotic' 
GROUP BY pi.speciality 
ORDER BY prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('Internal Medicine', 298), ('Surgery', 82)]

### Exercise 66: Count antibiotic prescriptions per facility (join with provider_information).

In [193]:
%%sql 
SELECT pi.facility, COUNT(m.drug_class) AS prescription_count 
FROM medications m 
JOIN provider_information pi ON m.license_number=pi.license_number 
WHERE m.drug_class='Antibiotic' 
GROUP BY pi.facility 
ORDER BY prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
4 rows affected.

[('CHUB', 154), ('CHUK', 78), ('Kibungo RH', 75), ('Kibuye RH', 73)]

### Exercise 69: Antibiotic prescriptions per month (GROUP BY MONTH(start_date)).

In [194]:
%%sql 
SELECT MONTH(start_date) AS month, COUNT(*) AS AntibioticPrescriptionCount 
FROM medications 
WHERE drug_class='Antibiotic' 
GROUP BY MONTH(start_date) 
ORDER BY month;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
12 rows affected.

[(1, 24),
 (2, 27),
 (3, 28),
 (4, 41),
 (5, 36),
 (6, 26),
 (7, 37),
 (8, 39),
 (9, 30),
 (10, 24),
 (11, 38),
 (12, 30)]

### Exercise 70: Antibiotic prescriptions with duration_days > 7 by prescriber.

In [199]:
%%sql 
SELECT pi.license_number, pi.provider_name, 
ABS(DATEDIFF(m.start_date, m.end_date)) AS duration 
FROM medications m 
JOIN provider_information pi ON m.license_number=pi.license_number 
WHERE m.drug_class='Antibiotic' 
AND ABS(DATEDIFF(m.end_date, m.start_date))>7 
ORDER BY duration DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

# 7. Diagnosis code mapping and encounter analytics

### Exercise 71: Count encounters per diagnosis_code per facility (GROUP BY facility, diagnosis_code).

In [202]:
%%sql 
SELECT ce.diagnosis_name, pi.facility, COUNT(*) AS diagnosis_count 
FROM clinical_encounter ce 
JOIN medications m ON ce.pid=m.pid 
JOIN provider_information pi ON m.license_number=pi.license_number 
GROUP BY ce.diagnosis_name, pi.facility 
ORDER BY diagnosis_name, diagnosis_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
30 rows affected.

[('Concussion', 'CHUB', 164),
 ('Concussion', 'Kibungo RH', 113),
 ('Concussion', 'Kibuye RH', 110),
 ('Concussion', 'CHUK', 83),
 ('Concussion', 'KMH', 75),
 ('Encounter for general adult medical examination', 'CHUB', 185),
 ('Encounter for general adult medical examination', 'Kibungo RH', 111),
 ('Encounter for general adult medical examination', 'Kibuye RH', 107),
 ('Encounter for general adult medical examination', 'CHUK', 82),
 ('Encounter for general adult medical examination', 'KMH', 62),
 ('Essential (primary) hypertension', 'CHUB', 176),
 ('Essential (primary) hypertension', 'Kibuye RH', 116),
 ('Essential (primary) hypertension', 'Kibungo RH', 114),
 ('Essential (primary) hypertension', 'CHUK', 93),
 ('Essential (primary) hypertension', 'KMH', 57),
 ('Infectious gastroenteritis and colitis, unspecified', 'CHUB', 175),
 ('Infectious gastroenteritis and colitis, unspecified', 'Kibuye RH', 127),
 ('Infectious gastroenteritis and colitis, unspecified', 'Kibungo RH', 101),
 ('Infectious gastroenteritis and colitis, unspecified', 'CHUK', 99),
 ('Infectious gastroenteritis and colitis, unspecified', 'KMH', 75),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'CHUB', 213),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Kibuye RH', 124),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Kibungo RH', 122),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'CHUK', 93),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'KMH', 71),
 ('Type 2 diabetes mellitus', 'CHUB', 203),
 ('Type 2 diabetes mellitus', 'Kibuye RH', 101),
 ('Type 2 diabetes mellitus', 'CHUK', 96),
 ('Type 2 diabetes mellitus', 'Kibungo RH', 75),
 ('Type 2 diabetes mellitus', 'KMH', 44)]

### Exercise 72: Top diagnosis_code per facility (rank with ORDER BY and LIMIT per facility using a window function, if available).

In [208]:
%%sql 
SELECT diagnosis_name, facility, diagnosis_count
FROM (
    SELECT 
        ce.diagnosis_name,
        ce.facility,
        COUNT(*) AS diagnosis_count,
        ROW_NUMBER() OVER (
            PARTITION BY ce.facility 
            ORDER BY COUNT(*) DESC
        ) AS rn
    FROM clinical_encounter ce
    GROUP BY ce.facility, ce.diagnosis_name
) ranked
WHERE rn <= 3
ORDER BY facility;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
15 rows affected.

[('Influenza due to other identified influenza virus with other respiratory manifestations', 'CHUB', 105),
 ('Infectious gastroenteritis and colitis, unspecified', 'CHUB', 101),
 ('Essential (primary) hypertension', 'CHUB', 95),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'CHUK', 121),
 ('Infectious gastroenteritis and colitis, unspecified', 'CHUK', 103),
 ('Type 2 diabetes mellitus', 'CHUK', 102),
 ('Encounter for general adult medical examination', 'Kibungo RH', 108),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Kibungo RH', 102),
 ('Type 2 diabetes mellitus', 'Kibungo RH', 102),
 ('Type 2 diabetes mellitus', 'Kibuye RH', 105),
 ('Concussion', 'Kibuye RH', 105),
 ('Infectious gastroenteritis and colitis, unspecified', 'Kibuye RH', 104),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'RMH', 117),
 ('Concussion', 'RMH', 106),
 ('Essential (primary) hypertension', 'RMH', 103)]

### Exercise 73: Encounters with outcome = 'Deceased' grouped by diagnosis_code.

In [210]:
%%sql 
SELECT diagnosis_name, outcome, COUNT(*) AS outcome_count 
FROM clinical_encounter 
GROUP BY diagnosis_name, outcome 
ORDER BY diagnosis_name, outcome_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
24 rows affected.

[('Concussion', 'Discharged', 129),
 ('Concussion', 'Referred', 126),
 ('Concussion', 'Deceased', 122),
 ('Concussion', 'Admitted', 118),
 ('Encounter for general adult medical examination', 'Referred', 134),
 ('Encounter for general adult medical examination', 'Admitted', 122),
 ('Encounter for general adult medical examination', 'Discharged', 112),
 ('Encounter for general adult medical examination', 'Deceased', 111),
 ('Essential (primary) hypertension', 'Discharged', 140),
 ('Essential (primary) hypertension', 'Admitted', 124),
 ('Essential (primary) hypertension', 'Referred', 121),
 ('Essential (primary) hypertension', 'Deceased', 101),
 ('Infectious gastroenteritis and colitis, unspecified', 'Discharged', 133),
 ('Infectious gastroenteritis and colitis, unspecified', 'Deceased', 131),
 ('Infectious gastroenteritis and colitis, unspecified', 'Referred', 122),
 ('Infectious gastroenteritis and colitis, unspecified', 'Admitted', 120),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Discharged', 147),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Deceased', 135),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Referred', 135),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 'Admitted', 130),
 ('Type 2 diabetes mellitus', 'Deceased', 132),
 ('Type 2 diabetes mellitus', 'Admitted', 126),
 ('Type 2 diabetes mellitus', 'Discharged', 124),
 ('Type 2 diabetes mellitus', 'Referred', 105)]

### Exercise 74: Follow-up required encounters grouped by diagnosis_code and count.

In [213]:
%%sql 
SELECT diagnosis_name, COUNT(*) AS followup_required_count 
FROM clinical_encounter 
WHERE followup_required=1 
GROUP BY diagnosis_name 
ORDER BY followup_required_count;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('Encounter for general adult medical examination', 230),
 ('Type 2 diabetes mellitus', 234),
 ('Concussion', 243),
 ('Infectious gastroenteritis and colitis, unspecified', 247),
 ('Essential (primary) hypertension', 250),
 ('Influenza due to other identified influenza virus with other respiratory manifestations', 282)]

### Exercise 75: Encounters per encounter_type per facility.

In [215]:
%%sql 
SELECT facility, encounter_type, COUNT(*) AS encounter_count 
FROM clinical_encounter 
GROUP BY facility, encounter_type 
ORDER BY facility, encounter_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('CHUB', 'Inpatient', 303),
 ('CHUB', 'Outpatient', 271),
 ('CHUK', 'Inpatient', 321),
 ('CHUK', 'Outpatient', 301),
 ('Kibungo RH', 'Inpatient', 313),
 ('Kibungo RH', 'Outpatient', 288),
 ('Kibuye RH', 'Inpatient', 313),
 ('Kibuye RH', 'Outpatient', 292),
 ('RMH', 'Inpatient', 342),
 ('RMH', 'Outpatient', 256)]

### Exercise 76: Patients with both inpatient and outpatient encounters (group and HAVING).

In [218]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name 
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
WHERE ce.encounter_type IN ('Inpatient','Outpatient') 
GROUP BY pd.pid, pd.first_name, pd.last_name 
HAVING COUNT(DISTINCT ce.encounter_type)=2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[('84591Q', 'Amy', 'Craig')]

### Exercise 77: First encounter_date per patient (MIN).

In [219]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, MIN(ce.encounter_date) AS first_encounter_date 
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
GROUP BY pd.pid, pd.first_name, pd.last_name 
ORDER BY first_encounter_date 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('95315S', 'Courtney', 'Meyer', datetime.date(2023, 11, 29)),
 ('90305K', 'Laura', 'Jackson', datetime.date(2023, 11, 30)),
 ('18268F', 'Meghan', 'Flores', datetime.date(2023, 11, 30)),
 ('84821V', 'Sharon', 'Carter', datetime.date(2023, 11, 30)),
 ('40054N', 'Jason', 'Bennett', datetime.date(2023, 11, 30))]

### Exercise 78: Most recent encounter_date per patient (MAX).

In [220]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, MAX(ce.encounter_date) AS recent_encounter_date 
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
GROUP BY pd.pid, pd.first_name, pd.last_name 
ORDER BY recent_encounter_date DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('40573L', 'Thomas', 'MD', datetime.date(2025, 11, 28)),
 ('24650U', 'Jordan', 'Mosley', datetime.date(2025, 11, 28)),
 ('80446D', 'Cameron', 'Erickson', datetime.date(2025, 11, 28)),
 ('33005P', 'Steven', 'Villanueva', datetime.date(2025, 11, 28)),
 ('03920A', 'Micheal', 'Reeves', datetime.date(2025, 11, 27))]

### Exercise 79: Average encounters per patient (overall and by sex).

In [222]:
%%sql 
-- Average encounter per patient 
SELECT AVG(encounter_count) AS average_encounter_per_patient 
FROM (SELECT ce.pid, COUNT(*) AS encounter_count 
FROM clinical_encounter ce GROUP BY ce.pid) sub;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[(Decimal('1.0007'),)]

In [223]:
%%sql 
-- Average encounter per sex 
SELECT pd.sex, AVG(encounter_count) AS average_encounter_per_sex 
FROM (SELECT ce.pid, COUNT(*) AS encounter_count FROM clinical_encounter ce GROUP BY ce.pid) sub 
JOIN patient_demographics pd ON sub.pid=pd.pid 
GROUP BY pd.sex;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('Male', Decimal('1.0007')), ('Female', Decimal('1.0007'))]

### Exercise 80: Count procedures occurrences (split by comma if stored as list; or direct group by procedures).

In [226]:
%%sql 
SELECT procedures, COUNT(*) AS procedure_count 
FROM clinical_encounter 
GROUP BY procedures 
ORDER BY procedure_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('Surgery', 641),
 ('MRI', 614),
 ('X-Ray', 607),
 ('Vaccination', 602),
 ('CT Scan', 536)]

# 8. Vitals and labs analytics

### Exercise 81: Latest vitals per pid using MAX(collection_date) and join back to the row.

In [228]:
%%sql 
-- Latest labs 
SELECT pid, MAX(collection_date) AS latest_labs 
FROM vitals_and_labs 
GROUP BY pid 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', datetime.date(2025, 7, 3)),
 ('00146Z', datetime.date(2024, 4, 12)),
 ('00156I', datetime.date(2025, 9, 13)),
 ('00157V', datetime.date(2025, 4, 23)),
 ('00178H', datetime.date(2025, 3, 2))]

In [231]:
%%sql 
-- Joining with other rows 
SELECT v.* FROM vitals_and_labs v 
JOIN (
    SELECT pid, MAX(collection_date) AS latest_labs 
    FROM vitals_and_labs GROUP BY pid
) latest 
ON v.pid=latest.pid AND v.collection_date=latest.latest_labs 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(383, '00026B', 151, 77, 94, 16, Decimal('39.8'), 94, Decimal('85.60'), Decimal('189.70'), Decimal('23.80'), 'Malaria RDT', 'Negative', '', 'Normal', datetime.date(2025, 7, 3)),
 (2031, '00146Z', 150, 62, 64, 15, Decimal('37.0'), 93, Decimal('64.70'), Decimal('157.10'), Decimal('26.20'), 'Glucosemia', '8.8', 'mmol/L', 'Critical', datetime.date(2024, 4, 12)),
 (1550, '00156I', 163, 84, 80, 19, Decimal('38.0'), 96, Decimal('64.40'), Decimal('183.30'), Decimal('19.20'), 'HIV Test', 'Negative', '', 'Normal', datetime.date(2025, 9, 13)),
 (1969, '00157V', 110, 106, 95, 20, Decimal('39.8'), 99, Decimal('80.50'), Decimal('186.00'), Decimal('23.30'), 'Glucosemia', '2.3', 'mmol/L', 'Critical', datetime.date(2025, 4, 23)),
 (277, '00178H', 142, 76, 81, 17, Decimal('38.4'), 95, Decimal('56.50'), Decimal('155.60'), Decimal('23.30'), 'Hemoglobin', '16.7', 'g/dL', 'Abnormal', datetime.date(2025, 3, 2))]

### Exercise 82: Abnormal lab_result_flag count per lab_test_name.

In [233]:
%%sql 
SELECT lab_test_name, lab_result_flag, COUNT(*) AS abnormal_lab_count 
FROM vitals_and_labs 
WHERE lab_result_flag IN ('Abnormal', 'Critical') 
GROUP BY Lab_test_name, lab_result_flag 
ORDER BY lab_test_name, abnormal_lab_count;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[('Creatinine', 'Abnormal', 243),
 ('Creatinine', 'Critical', 265),
 ('Glucosemia', 'Abnormal', 162),
 ('Glucosemia', 'Critical', 168),
 ('Hemoglobin', 'Critical', 136),
 ('Hemoglobin', 'Abnormal', 161),
 ('HIV Test', 'Critical', 321),
 ('Malaria RDT', 'Critical', 286)]

### Exercise 83: Critical lab_result_flag cases per pid.

In [234]:
%%sql 
SELECT pid, lab_test_name, lab_result_flag, COUNT(*) AS critical_lab_count 
FROM vitals_and_labs 
WHERE lab_result_flag='Critical' 
GROUP BY pid, lab_test_name, lab_result_flag 
ORDER BY pid, lab_test_name 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00146Z', 'Glucosemia', 'Critical', 1),
 ('00157V', 'Glucosemia', 'Critical', 1),
 ('00366I', 'Creatinine', 'Critical', 1),
 ('00493W', 'Malaria RDT', 'Critical', 1),
 ('00533B', 'Glucosemia', 'Critical', 1)]

### Exercise 84: Average temperature per pid by month (GROUP BY pid, MONTH(collection_date)).

In [237]:
%%sql 
SELECT pid, MONTH(collection_date) AS month, ROUND(AVG(temperature),2) AS avg_temp
FROM vitals_and_labs 
GROUP BY pid, MONTH(collection_date) 
ORDER BY avg_temp 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('01545W', 10, Decimal('36.00')),
 ('90229S', 4, Decimal('36.00')),
 ('48624J', 4, Decimal('36.00')),
 ('15099H', 6, Decimal('36.00')),
 ('38983S', 2, Decimal('36.00'))]

### Exercise 85: Patients with oxygen_saturation < 90 on any reading.

In [240]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, v.oxygen_saturation 
FROM patient_demographics pd 
JOIN vitals_and_labs v ON pd.pid=v.pid 
WHERE v.oxygen_saturation BETWEEN 90 AND 95
ORDER BY v.collection_date DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('80446D', 'Cameron', 'Erickson', 95),
 ('24650U', 'Jordan', 'Mosley', 94),
 ('33005P', 'Steven', 'Villanueva', 95),
 ('03920A', 'Micheal', 'Reeves', 93),
 ('08556V', 'Melissa', 'Smith', 93)]

### Exercise 86: Average heart_rate and respiratory_rate by outcome of nearest encounter (join on date logic).

In [241]:
%%sql 
SELECT MONTH(collection_date) AS month, AVG(heart_rate) AS avg_HR, AVG(respiratory_rate) AS av_RR 
FROM vitals_and_labs 
GROUP BY MONTH(collection_date) 
ORDER BY month;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
12 rows affected.

[(1, Decimal('78.0798'), Decimal('16.0714')),
 (2, Decimal('79.2137'), Decimal('16.0983')),
 (3, Decimal('79.4730'), Decimal('15.9710')),
 (4, Decimal('79.2280'), Decimal('16.1760')),
 (5, Decimal('80.5911'), Decimal('15.9595')),
 (6, Decimal('80.2305'), Decimal('15.8203')),
 (7, Decimal('80.4746'), Decimal('15.9529')),
 (8, Decimal('79.9341'), Decimal('16.0814')),
 (9, Decimal('80.3436'), Decimal('15.9780')),
 (10, Decimal('80.5400'), Decimal('15.8840')),
 (11, Decimal('78.8989'), Decimal('15.8577')),
 (12, Decimal('80.5195'), Decimal('16.2031'))]

### Exercise 87: Top 10 most frequently ordered lab_test_name.

In [242]:
%%sql 
SELECT lab_test_name, COUNT(*) AS order_count 
FROM vitals_and_labs 
GROUP BY lab_test_name 
ORDER BY order_count DESC 
LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('HIV Test', 653),
 ('Hemoglobin', 598),
 ('Creatinine', 598),
 ('Glucosemia', 580),
 ('Malaria RDT', 571)]

### Exercise 89: Lab_result_value distribution for a test (cast numeric if appropriate; otherwise count by ranges with CASE).

In [246]:
%%sql 
SELECT 
CASE WHEN lab_result_value >17.2 THEN 'Polycytemia' 
     WHEN lab_result_value BETWEEN 13.8  AND 17.2 THEN 'Normal' 
     WHEN lab_result_value BETWEEN 10.0  AND 13.7 THEN 'Low Hb' 
     WHEN lab_result_value BETWEEN 7.0  AND 9.9 THEN 'Moderate anemia' 
     WHEN lab_result_value <7.0 THEN 'Severe anemia' 
     END AS Hb_class,
     COUNT(*) AS patients_count 
FROM vitals_and_labs 
WHERE lab_test_name='Hemoglobin' 
GROUP BY Hb_class 
ORDER BY patients_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[('Low Hb', 305), ('Normal', 242), ('Polycytemia', 51)]

### Exercise 90: Time to first abnormal result from first encounter (DATEDIFF between dates via join/subquery).

In [248]:
%%sql 
SELECT e.pid,
       DATEDIFF(l.first_abnormal_date, e.first_encounter_date) AS days_to_abnormal
FROM (
    SELECT pid, MIN(encounter_date) AS first_encounter_date
    FROM clinical_encounter
    GROUP BY pid
) e
JOIN (
    SELECT pid, MIN(collection_date) AS first_abnormal_date
    FROM vitals_and_labs 
    WHERE lab_result_flag = 'Abnormal'
    GROUP BY pid
) l
  ON e.pid = l.pid
ORDER BY days_to_abnormal 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('01877R', 0), ('02209J', 0), ('00587S', 0), ('02318M', 0), ('01126C', 0)]

# 9. Views, reusable summaries

### Exercise 91: Create view patients_over_50_view showing pid, name, age >= 50.

In [256]:
%%sql 
CREATE VIEW patient_over_50_view AS 
SELECT pd.pid, pd.first_name, pd.last_name, pd.age 
FROM patient_demographics pd 
WHERE pd.age>=50 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [257]:
# Now let's call a view 
%sql SELECT * FROM patient_over_50_view;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00157V', 'Amy', 'Ramirez', 80),
 ('00266K', 'Cody', 'Lloyd', 81),
 ('00305E', 'Aaron', 'Newman', 80),
 ('00315K', 'Mark', 'Davis', 70),
 ('00366I', 'Nicholas', 'Gentry', 50)]

### Exercise 92: Create view facility_diagnosis_summary_view (facility, diagnosis_code, encounter_count).

In [258]:
%%sql 
CREATE VIEW facility_diagnosis_summary_view AS 
SELECT ce.facility, ce.diagnosis_code, COUNT(*) AS encounter_count 
FROM clinical_encounter ce 
GROUP BY ce.facility, ce.diagnosis_code 
ORDER BY ce.facility, encounter_count;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [259]:
# Let's now call view
%sql SELECT * FROM facility_diagnosis_summary_view;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
30 rows affected.

[('CHUB', 'E11', 88),
 ('CHUB', 'Z00.0', 92),
 ('CHUB', 'S06.0', 93),
 ('CHUB', 'I10', 95),
 ('CHUB', 'A09', 101),
 ('CHUB', 'J10.1', 105),
 ('CHUK', 'I10', 95),
 ('CHUK', 'Z00.0', 99),
 ('CHUK', 'E11', 102),
 ('CHUK', 'S06.0', 102),
 ('CHUK', 'A09', 103),
 ('CHUK', 'J10.1', 121),
 ('Kibungo RH', 'S06.0', 89),
 ('Kibungo RH', 'I10', 99),
 ('Kibungo RH', 'A09', 101),
 ('Kibungo RH', 'J10.1', 102),
 ('Kibungo RH', 'E11', 102),
 ('Kibungo RH', 'Z00.0', 108),
 ('Kibuye RH', 'I10', 94),
 ('Kibuye RH', 'Z00.0', 95),
 ('Kibuye RH', 'J10.1', 102),
 ('Kibuye RH', 'A09', 104),
 ('Kibuye RH', 'E11', 105),
 ('Kibuye RH', 'S06.0', 105),
 ('RMH', 'Z00.0', 85),
 ('RMH', 'E11', 90),
 ('RMH', 'A09', 97),
 ('RMH', 'I10', 103),
 ('RMH', 'S06.0', 106),
 ('RMH', 'J10.1', 117)]

### Exercise 93: Create view antibiotic_prescriber_summary_view (prescriber, licence_number, speciality, prescription_count).

In [261]:
%%sql 
CREATE VIEW antibiotic_prescriber_summary_view AS 
SELECT pi.license_number, pi.speciality, COUNT(*) AS prescription_count 
FROM provider_information pi 
JOIN medications m ON pi.license_number=m.license_number 
WHERE m.drug_class='Antibiotic' 
GROUP BY pi.license_number, pi.speciality 
ORDER BY prescription_count;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [262]:
# Let's now call the view
%sql SELECT * FROM antibiotic_prescriber_summary_view;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('RMDC7353', 'Internal Medicine', 72),
 ('RMDC1079', 'Internal Medicine', 73),
 ('RMDC4131', 'Internal Medicine', 75),
 ('RMDC6153', 'Internal Medicine', 78),
 ('RMDC2727', 'Surgery', 82)]

### Exercise 94: Create view patient_latest_vitals_view (pid + latest vitals row).

In [268]:
%%sql 
CREATE VIEW patient_latest_vitals_view AS 
SELECT v.* FROM 
(SELECT pid, MAX(collection_date) AS latest_lab_date 
FROM vitals_and_labs 
GROUP BY pid 
ORDER BY latest_lab_date DESC) latest 
JOIN vitals_and_labs v ON v.pid=latest.pid AND v.collection_date=latest.latest_lab_date 
ORDER BY v.collection_date DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [269]:
# NOw let's call a view
%sql SELECT * FROM patient_latest_vitals_view;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[(2668, '80446D', 178, 88, 84, 17, Decimal('37.4'), 95, Decimal('68.40'), Decimal('187.50'), Decimal('19.50'), 'Malaria RDT', 'Negative', '', 'Normal', datetime.date(2025, 11, 30)),
 (2458, '00391J', 137, 70, 93, 20, Decimal('37.2'), 99, Decimal('47.80'), Decimal('175.00'), Decimal('15.60'), 'Hemoglobin', '13.3', 'g/dL', 'Normal', datetime.date(2025, 11, 29)),
 (2590, '40573L', 102, 60, 79, 19, Decimal('38.7'), 100, Decimal('57.70'), Decimal('158.80'), Decimal('22.90'), 'HIV Test', 'Positive', '', 'Critical', datetime.date(2025, 11, 29)),
 (2745, '11401N', 113, 103, 90, 20, Decimal('38.2'), 100, Decimal('58.10'), Decimal('181.00'), Decimal('17.70'), 'Glucosemia', '3.0', 'mmol/L', 'Abnormal', datetime.date(2025, 11, 28)),
 (356, '24650U', 160, 76, 97, 14, Decimal('36.2'), 94, Decimal('51.00'), Decimal('176.30'), Decimal('16.40'), 'Hemoglobin', '13.8', 'g/dL', 'Normal', datetime.date(2025, 11, 28))]

### Exercise 95: Create view patient_journey_view joining demographics, encounters, medications (key columns).

In [271]:
%%sql 
CREATE VIEW patient_journey_view AS 
SELECT pd.pid, pd.first_name, pd.last_name, ce.diagnosis_code, ce.encounter_date, 
m.drug_name, m.drug_class, m.start_date, m.end_date, ce.outcome, ce.facility, pi.license_number, 
pi.provider_name, pi.speciality 
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
JOIN medications m ON ce.pid=m.pid 
JOIN provider_information pi ON m.license_number=pi.license_number 
ORDER BY ce.encounter_date DESC 
LIMIT 10;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [272]:
# Let's now call the view
%sql SELECT * FROM patient_journey_view;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
10 rows affected.

[('24650U', 'Jordan', 'Mosley', 'A09', datetime.date(2025, 11, 28), 'Ciprofloxacin', 'Antibiotic', datetime.date(2025, 11, 28), datetime.date(2025, 12, 3), 'Deceased', 'CHUK', 'RMDC7353', 'Dr. Mukamana', 'Internal Medicine'),
 ('24650U', 'Jordan', 'Mosley', 'A09', datetime.date(2025, 11, 28), 'ORS', 'Rehydration', datetime.date(2025, 11, 28), datetime.date(2025, 12, 1), 'Deceased', 'CHUK', 'RMDC7353', 'Dr. Mukamana', 'Internal Medicine'),
 ('33005P', 'Steven', 'Villanueva', 'J10.1', datetime.date(2025, 11, 28), 'Artemether-Lumefantrine', 'Antimalarial', datetime.date(2025, 11, 28), datetime.date(2025, 12, 1), 'Deceased', 'Kibungo RH', 'RMDC1079', 'Dr. Mugisha', 'Internal Medicine'),
 ('40573L', 'Thomas', 'MD', 'E11', datetime.date(2025, 11, 28), 'Paracetamol', 'Analgesic', datetime.date(2025, 11, 28), datetime.date(2025, 12, 1), 'Admitted', 'Kibuye RH', 'RMDC7286', 'Dr. Nkurunziza', 'Surgery'),
 ('80446D', 'Cameron', 'Erickson', 'I10', datetime.date(2025, 11, 28), 'Artemether-Lumefantrine', 'Antimalarial', datetime.date(2025, 11, 28), datetime.date(2025, 12, 1), 'Discharged', 'RMH', 'RMDC6153', 'Dr. Kayitesi', 'Internal Medicine'),
 ('03920A', 'Micheal', 'Reeves', 'A09', datetime.date(2025, 11, 27), 'Metformin', 'Antidiabetic', datetime.date(2025, 11, 27), datetime.date(2025, 12, 27), 'Discharged', 'CHUK', 'RMDC7353', 'Dr. Mukamana', 'Internal Medicine'),
 ('11401N', 'David', 'Fitzpatrick', 'J10.1', datetime.date(2025, 11, 27), 'Artemether-Lumefantrine', 'Antimalarial', datetime.date(2025, 11, 27), datetime.date(2025, 11, 30), 'Deceased', 'RMH', 'RMDC2727', 'Dr. Uwamahoro', 'Surgery'),
 ('75637E', 'Shannon', 'Taylor', 'S06.0', datetime.date(2025, 11, 26), 'Ciprofloxacin', 'Antibiotic', datetime.date(2025, 11, 26), datetime.date(2025, 12, 1), 'Discharged', 'CHUB', 'RMDC4131', 'Dr. Hakizimana', 'Internal Medicine'),
 ('75637E', 'Shannon', 'Taylor', 'S06.0', datetime.date(2025, 11, 26), 'ORS', 'Rehydration', datetime.date(2025, 11, 26), datetime.date(2025, 11, 29), 'Discharged', 'CHUB', 'RMDC4131', 'Dr. Hakizimana', 'Internal Medicine'),
 ('54628U', 'Richard', 'Francis', 'Z00.0', datetime.date(2025, 11, 26), 'Artemether-Lumefantrine', 'Antimalarial', datetime.date(2025, 11, 26), datetime.date(2025, 11, 29), 'Referred', 'Kibuye RH', 'RMDC2727', 'Dr. Uwamahoro', 'Surgery')]

# 10. Window functions and CTEs

### Exercise 96. Use ROW_NUMBER() to enumerate encounters per patient by encounter_date.

In [276]:
%%sql 
SELECT ce.pid, ce.encounter_date, ce.encounter_type, 
ROW_NUMBER() OVER (
    PARTITION BY ce.pid ORDER BY ce.encounter_date ASC) 
AS encounter_number 
FROM clinical_encounter ce 
ORDER BY ce.pid, encounter_number DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', datetime.date(2025, 7, 1), 'Inpatient', 1),
 ('00146Z', datetime.date(2024, 4, 12), 'Outpatient', 1),
 ('00156I', datetime.date(2025, 9, 12), 'Inpatient', 1),
 ('00157V', datetime.date(2025, 4, 23), 'Inpatient', 1),
 ('00178H', datetime.date(2025, 2, 27), 'Inpatient', 1)]

### Exercise 97: Use RANK() to find top diagnosis_code per facility.

In [279]:
%%sql 
SELECT facility, diagnosis_code, diagnosis_count, 
RANK() OVER (PARTITION BY FACILITY ORDER BY diagnosis_count DESC) AS diagnosis_rank 
FROM (SELECT ce.facility, ce.diagnosis_code, COUNT(*) AS diagnosis_count 
     FROM clinical_encounter ce 
    GROUP BY ce.facility, ce.diagnosis_code) sub 
ORDER BY facility, diagnosis_rank;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
30 rows affected.

[('CHUB', 'J10.1', 105, 1),
 ('CHUB', 'A09', 101, 2),
 ('CHUB', 'I10', 95, 3),
 ('CHUB', 'S06.0', 93, 4),
 ('CHUB', 'Z00.0', 92, 5),
 ('CHUB', 'E11', 88, 6),
 ('CHUK', 'J10.1', 121, 1),
 ('CHUK', 'A09', 103, 2),
 ('CHUK', 'E11', 102, 3),
 ('CHUK', 'S06.0', 102, 3),
 ('CHUK', 'Z00.0', 99, 5),
 ('CHUK', 'I10', 95, 6),
 ('Kibungo RH', 'Z00.0', 108, 1),
 ('Kibungo RH', 'J10.1', 102, 2),
 ('Kibungo RH', 'E11', 102, 2),
 ('Kibungo RH', 'A09', 101, 4),
 ('Kibungo RH', 'I10', 99, 5),
 ('Kibungo RH', 'S06.0', 89, 6),
 ('Kibuye RH', 'E11', 105, 1),
 ('Kibuye RH', 'S06.0', 105, 1),
 ('Kibuye RH', 'A09', 104, 3),
 ('Kibuye RH', 'J10.1', 102, 4),
 ('Kibuye RH', 'Z00.0', 95, 5),
 ('Kibuye RH', 'I10', 94, 6),
 ('RMH', 'J10.1', 117, 1),
 ('RMH', 'S06.0', 106, 2),
 ('RMH', 'I10', 103, 3),
 ('RMH', 'A09', 97, 4),
 ('RMH', 'E11', 90, 5),
 ('RMH', 'Z00.0', 85, 6)]

### Exercise 98: Use LAG() to compute change in systolic BP between consecutive vitals per pid.

In [287]:
%%sql 
SELECT v.pid, v.collection_date, v.bp_systole, 
LAG (v.bp_systole) 
OVER (PARTITION BY v.pid ORDER BY v.collection_date) AS prev_sbp, 
v.bp_systole-LAG (v.bp_systole) OVER (PARTITION BY v.pid ORDER BY v.collection_date) AS change_in_SBP 
FROM vitals_and_labs v 
ORDER BY v.collection_date, change_in_SBP DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('95315S', datetime.date(2023, 11, 29), 164, None, None),
 ('40054N', datetime.date(2023, 11, 30), 180, None, None),
 ('34841T', datetime.date(2023, 12, 2), 142, None, None),
 ('75673A', datetime.date(2023, 12, 2), 171, None, None),
 ('84821V', datetime.date(2023, 12, 2), 135, None, None)]

### Exercise 99: Use LEAD() to predict next scheduled end_date from start_date sequences per pid.

In [295]:
%%sql 
SELECT * FROM (SELECT m.pid, m.start_date, m.end_date, 
LEAD(m.end_date) OVER (PARTITION BY m.pid ORDER BY m.start_date) AS next_encounter_date 
FROM medications m ) sub 
WHERE next_encounter_date IS NOT NULL 
ORDER BY sub.pid, sub.next_encounter_date ASC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00156I', datetime.date(2025, 9, 12), datetime.date(2025, 9, 15), datetime.date(2025, 9, 19)),
 ('00292K', datetime.date(2025, 4, 17), datetime.date(2025, 4, 20), datetime.date(2025, 4, 22)),
 ('00430D', datetime.date(2023, 12, 22), datetime.date(2023, 12, 27), datetime.date(2023, 12, 25)),
 ('00664U', datetime.date(2024, 8, 13), datetime.date(2024, 8, 16), datetime.date(2024, 8, 20)),
 ('00965S', datetime.date(2025, 9, 3), datetime.date(2025, 9, 6), datetime.date(2025, 9, 8))]

### Exercise 100: Use a CTE to compute encounter counts, then select patients above the median (combine counts + window or subquery).

In [298]:
%%sql 
WITH encounter_counts AS (
    SELECT ce.pid, COUNT(*) AS encounter_count
    FROM clinical_encounter ce
    GROUP BY ce.pid
),
ranked AS (
    SELECT encounter_count,
           ROW_NUMBER() OVER (ORDER BY encounter_count) AS rn,
           COUNT(*) OVER () AS total_count
    FROM encounter_counts
)
SELECT ec.pid, ec.encounter_count
FROM encounter_counts ec
JOIN ranked r ON ec.encounter_count = r.encounter_count
WHERE ec.encounter_count >
      (SELECT AVG(encounter_count) 
       FROM (
           SELECT encounter_count
           FROM ranked
           WHERE rn IN (FLOOR(total_count/2), CEIL(total_count/2))
       ) median_sub) 
    LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
4 rows affected.

[('84591Q', 2), ('84591Q', 2), ('91820L', 2), ('91820L', 2)]

### Exercise 101: Use a CTE to compute prescription counts per prescriber, then filter where count > overall average.

In [299]:
%%sql 
WITH prescription_count AS (
    SELECT m.license_number, pi.provider_name, pi.speciality, COUNT(*) AS total_prescription 
    FROM medications m JOIN provider_information pi ON m.license_number=pi.license_number 
    GROUP BY m.license_number
)
SELECT * FROM prescription_count 
WHERE total_prescription > (SELECT AVG(total_prescription) FROM prescription_count) 
ORDER BY total_prescription;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[('RMDC3353', 'Dr. Ndahiro', 'Emergency', 314),
 ('RMDC4131', 'Dr. Hakizimana', 'Internal Medicine', 415),
 ('RMDC7353', 'Dr. Mukamana', 'Internal Medicine', 440),
 ('RMDC1079', 'Dr. Mugisha', 'Internal Medicine', 453),
 ('RMDC6153', 'Dr. Kayitesi', 'Internal Medicine', 472),
 ('RMDC2727', 'Dr. Uwamahoro', 'Surgery', 559)]

### Exercise 102: Use a CTE to compute monthly trends of encounters per facility and return last 6 months.

In [311]:
%%sql 
WITH monthly_encounters AS (
    SELECT 
        LAST_DAY(ce.encounter_date) AS month_end_date,
        COUNT(*) AS encounter_count
    FROM clinical_encounter ce
    GROUP BY LAST_DAY(ce.encounter_date)
)
SELECT month_end_date, encounter_count
FROM monthly_encounters
WHERE month_end_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
ORDER BY month_end_date DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
6 rows affected.

[(datetime.date(2025, 11, 30), 126),
 (datetime.date(2025, 10, 31), 134),
 (datetime.date(2025, 9, 30), 109),
 (datetime.date(2025, 8, 31), 136),
 (datetime.date(2025, 7, 31), 142),
 (datetime.date(2025, 6, 30), 142)]

# 12. Transactions, constraints, triggers, indexes

### Exercise 103: Begin a transaction, insert a new encounter, then commit; rollback scenario if pid not found.

In [6]:
%%sql 
DELIMITER //

CREATE PROCEDURE add_encounter(
    IN p_pid VARCHAR(6),
    IN p_encounter_type VARCHAR(20),
    IN p_facility VARCHAR(100),
    IN p_reason_for_visit VARCHAR(200),
    IN p_diagnosis_code VARCHAR(10),
    IN p_procedures VARCHAR(100),
    IN p_outcome VARCHAR(20),
    IN p_followup_required TINYINT(1)
)
BEGIN
    DECLARE pid_exists INT;

    START TRANSACTION;

    SELECT COUNT(*) INTO pid_exists
    FROM patient_demographics
    WHERE pid = p_pid;

    IF pid_exists > 0 THEN
        INSERT INTO clinical_encounter (
            pid, encounter_date, encounter_type, facility,
            reason_for_visit, diagnosis_code, procedures,
            outcome, followup_required
        )
        VALUES (
            p_pid, CURDATE(), p_encounter_type, p_facility,
            p_reason_for_visit, p_diagnosis_code, p_procedures,
            p_outcome, p_followup_required
        );
        COMMIT;
    ELSE
        ROLLBACK;
    END IF;
END //

DELIMITER ;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [9]:
%%sql 
-- Let's call our stored procedure 
CALL add_encounter 
('00032R', 'Outpatient', 'CHUB', 'Screening', 'A09', 'Sugery', 'Discharged', 1);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 104: Add NOT NULL constraint to medications.prescriber (if your engine allows altering).

In [10]:
%%sql 
ALTER TABLE medications 
MODIFY COLUMN prescriber VARCHAR(100) NOT NULL;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 105: Add UNIQUE constraint on provider_information.license_number (if not already primary).

In [11]:
%%sql 
ALTER TABLE provider_information 
ADD CONSTRAINT unique_license_number UNIQUE(license_number);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 106: Create index on clinical_encounter(diagnosis_code) and compare EXPLAIN before/after for a diagnosis filter query.

In [13]:
%%sql 
-- Before index 
EXPLAIN 
SELECT * 
FROM clinical_encounter 
WHERE diagnosis_code = 'A09';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[("-> Filter: (clinical_encounter.diagnosis_code = 'A09')  (cost=305 rows=298)\n    -> Table scan on clinical_encounter  (cost=305 rows=2982)\n",)]

In [14]:
%%sql 
-- Create index 
CREATE INDEX idx_clinical_encounter 
ON clinical_encounter(diagnosis_code);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [15]:
%%sql 
-- Now let's check again the difference after creating index 
EXPLAIN 
SELECT * 
FROM clinical_encounter 
WHERE diagnosis_code='A09';

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
1 rows affected.

[("-> Index lookup on clinical_encounter using idx_clinical_encounter (diagnosis_code = 'A09')  (cost=70.8 rows=506)\n",)]

### Exercise 107: Create composite index on clinical_encounter(pid, encounter_date) and run a range query efficiently.

In [16]:
%%sql 
CREATE INDEX idx_pid_encounter_date 
ON clinical_encounter(pid, encounter_date);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [18]:
%%sql SELECT * FROM clinical_encounter 
WHERE encounter_date BETWEEN '2025-11-18' AND '2025-11-19' 
ORDER BY encounter_date;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[(229, '83564H', datetime.date(2025, 11, 18), 'Outpatient', 'CHUB', 'Fever', 'A09', 'MRI', 'Deceased', 1, 'Infectious gastroenteritis and colitis, unspecified'),
 (2437, '79735G', datetime.date(2025, 11, 18), 'Outpatient', 'CHUK', 'Cough', 'E11', 'X-Ray', 'Admitted', 0, 'Type 2 diabetes mellitus'),
 (2975, '03602F', datetime.date(2025, 11, 18), 'Inpatient', 'Kibuye RH', 'Follow-up', 'A09', 'Surgery', 'Deceased', 1, 'Infectious gastroenteritis and colitis, unspecified'),
 (897, '32812K', datetime.date(2025, 11, 19), 'Outpatient', 'RMH', 'Cough', 'S06.0', 'MRI', 'Referred', 1, 'Concussion'),
 (1945, '65332H', datetime.date(2025, 11, 19), 'Outpatient', 'CHUK', 'Routine Checkup', 'E11', 'X-Ray', 'Admitted', 1, 'Type 2 diabetes mellitus'),
 (2121, '33985I', datetime.date(2025, 11, 19), 'Inpatient', 'Kibungo RH', 'Routine Checkup', 'I10', 'Surgery', 'Deceased', 0, 'Essential (primary) hypertension'),
 (2519, '60473D', datetime.date(2025, 11, 19), 'Inpatient', 'CHUK', 'Follow-up', 'A09', 'Surgery', 'Discharged', 0, 'Infectious gastroenteritis and colitis, unspecified'),
 (2708, '99914O', datetime.date(2025, 11, 19), 'Inpatient', 'RMH', 'Screening', 'E11', 'MRI', 'Deceased', 1, 'Type 2 diabetes mellitus')]

### Exercise 108: Create index on medications(drug_class) and run antibiotic filter query.

In [19]:
%%sql 
CREATE INDEX idx_medications 
ON medications(drug_class);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [20]:
%%sql 
SELECT drug_class, COUNT(*) AS DrugClassCount 
FROM medications 
GROUP BY drug_class 
ORDER BY DrugClassCount DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
8 rows affected.

[('Analgesic', 756),
 ('Antihypertensive', 401),
 ('Antidiabetic', 382),
 ('Antibiotic', 380),
 ('Rehydration', 380),
 ('Antimalarial', 362),
 ('Antiviral', 352),
 ('Antiretroviral', 348)]

### Exercise 109: Create trigger to prevent duplicate pid insertion in patient_demographics (if not primary enforced).

In [21]:
%%sql 
DELIMITER // 
CREATE TRIGGER prevent_duplicate_pid 
BEFORE INSERT ON patient_demographics 
FOR EACH ROW 
BEGIN 
DECLARE pid_exists INT;

SELECT COUNT(*) INTO pid_exists 
FROM patient_demographics 
WHERE pid=NEW.pid;

IF pid_exists>0 THEN 
SIGNAL SQLSTATE '45000' 
SET MESSAGE_TEXT = 'Duplicate pid not allowed in patient_demographics'; 
END IF;
END // 
DELIMITER ;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [22]:
%sql select * from patient_demographics LIMIT 2;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('00026B', 'Dustin', 'Tate', 'Male', datetime.date(1991, 10, 20), 'Gasabo', 'Middle', 'MMI', Decimal('5.00'), 34),
 ('00146Z', 'Bethany', 'Lara', 'Male', datetime.date(2024, 11, 28), 'Kibungo', 'Middle', 'RSSB', Decimal('15.00'), 1)]

In [24]:
%%sql 
INSERT INTO patient_demographics (pid, first_name, last_name, sex, dob, residence, ses, insurance_type, copayment) 
VALUES ('00026B', 'Jean', 'Ukwizagira', 'Male', '1998-02-25', 'Gasabo', 'Middle', 'MMI', 15);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
(mysql.connector.errors.DatabaseError) 1644 (45000): Duplicate pid not allowed in patient_demographics
[SQL: INSERT INTO patient_demographics (pid, first_name, last_name, sex, dob, residence, ses, insurance_type, copayment)
VALUES ('00026B', 'Jean', 'Ukwizagira', 'Male', '1998-02-25', 'Gasabo', 'Middle', 'MMI', 15);]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

### Exercise 110: Create trigger to auto-set end_date = start_date + duration_days when inserting a medication.

In [25]:
%%sql 
DELIMITER // 
CREATE TRIGGER set_medications_end_date 
BEFORE INSERT ON medications 
FOR EACH ROW 
BEGIN 
-- calculate end_date AS start_date + duration_days 
SET NEW.end_date = DATE_ADD(NEW.start_date, INTERVAL NEW.duration_days DAY); 
END // 
DELIMITER ;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### EXERCISE 111: Create trigger to insert into an audit_log table whenever a medication row is updated.

In [27]:
%%sql 
CREATE TABLE audit_log (
    log_id INT AUTO_INCREMENT PRIMARY KEY,
    medication_id INT,
    action VARCHAR(20),
    old_value VARCHAR(255),
    new_value VARCHAR(255),
    changed_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [29]:
%%sql 
DELIMITER //

CREATE TRIGGER medication_update_audit
AFTER UPDATE ON medications
FOR EACH ROW
BEGIN
    INSERT INTO audit_log (drug_name, action, old_value, new_value)
    VALUES (
        OLD.drug_name,
        'UPDATE',
        OLD.diagnosis_code,
        NEW.diagnosis_code
    );
END //

DELIMITER ;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 112: Create trigger to flag followup_required = 1 when outcome = 'Admitted' in clinical_encounter.

In [30]:
%%sql 
DELIMITER //

CREATE TRIGGER flag_followup_on_admission
BEFORE INSERT ON clinical_encounter
FOR EACH ROW
BEGIN
    IF NEW.outcome = 'Admitted' THEN
        SET NEW.followup_required = 1;
    END IF;
END //

DELIMITER ;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [31]:
%%sql 
DELIMITER //

CREATE TRIGGER flag_followup_on_admission_update
BEFORE UPDATE ON clinical_encounter
FOR EACH ROW
BEGIN
    IF NEW.outcome = 'Admitted' THEN
        SET NEW.followup_required = 1;
    END IF;
END //

DELIMITER ;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

# 13. Security, roles, ETL, optimization

### Exercise 113: Create a database role doctor; grant INSERT on medications, SELECT on clinical_encounter.

In [34]:
%%sql 
-- Create a role 
DROP ROLE doctor;
CREATE ROLE doctor; 

-- Grant priviledges 
GRANT INSERT ON HospitalDB.medications TO doctor; 
GRANT INSERT ON HospitalDB.clinical_encounter TO doctor;
Grant SELECT ON HospitalDB.patient_demographics TO doctor;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [35]:
%%sql 
-- Assign role to the user 
CREATE USER 'simeon'@'localhost' IDENTIFIED BY '12345'; 
GRANT doctor TO 'simeon'@'localhost';
FLUSH PRIVILEGES;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.
0 rows affected.

[]

### Exercise 114: Create a database role nurse; grant SELECT on patient_demographics and vitals_and_labs only.

In [37]:
%%sql 
DROP ROLE nurse; 
CREATE ROLE nurse; 
GRANT SELECT ON HospitalDB.patient_demographics TO nurse; 
GRANT SELECT ON HospitalDB.vitals_and_labs TO nurse;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

### Exercise 115: Revoke UPDATE on medications from nurse role.

In [38]:
%%sql 
REVOKE UPDATE ON HospitalDB.medications FROM nurse;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
(mysql.connector.errors.ProgrammingError) 1147 (42000): There is no such grant defined for user 'nurse' on host '%' on table 'medications'
[SQL: REVOKE UPDATE ON HospitalDB.medications FROM nurse;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Exercise 116: Export patient_demographics to CSV (engine/tool-specific).

In [44]:
conn=mysql.connector.connect(user='njado', password='****', host='localhost', database='HospitalDB')
pd_df=pd.read_sql('SELECT * FROM patient_demographics', conn)
pd_df.to_csv(r'C:\Users\USER\OneDrive - University of Global Health Equity\Documents\PERSONAL DOCUMENTS\PERSONAL DEVELOPMENT\Projects Portfolio\SQL for Data Science\patient_demographics.csv')

### Exercise 117: Import vitals_and_labs from a CSV file (engine/tool-specific).

In [43]:
# Let's first export the table
import warnings 
warnings.filterwarnings('ignore')
v_df=pd.read_sql('SELECT * FROM vitals_and_labs', conn)
v_df.to_csv(r'C:\Users\USER\OneDrive - University of Global Health Equity\Documents\PERSONAL DOCUMENTS\PERSONAL DEVELOPMENT\Projects Portfolio\SQL for Data Science\vitals_and_labs.csv')

In [17]:
# Step 1: Read CSV from local computer
csv_path = r"C:\Users\USER\OneDrive - University of Global Health Equity\Documents\PERSONAL DOCUMENTS\PERSONAL DEVELOPMENT\Projects Portfolio\SQL for Data Science\vitals_and_labs.csv"
df = pd.read_csv(csv_path)

# Step 2: Connect to MySQL using SQLAlchemy engine
engine = create_engine("mysql+mysqlconnector://njado:****@localhost:3306/HospitalDB")

# Step 3: Write DataFrame into vitals_and_labs table
df.to_sql("vitals_and_labs", con=engine, if_exists="fail", index=False)

ValueError: Table 'vitals_and_labs' already exists.

In [4]:
%sql DESCRIBE vitals_and_labs;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
17 rows affected.

[('Unnamed: 0', 'bigint', 'YES', '', None, ''),
 ('vital_lab_id', 'bigint', 'YES', '', None, ''),
 ('pid', 'text', 'YES', '', None, ''),
 ('bp_systole', 'bigint', 'YES', '', None, ''),
 ('bp_diastole', 'bigint', 'YES', '', None, ''),
 ('heart_rate', 'bigint', 'YES', '', None, ''),
 ('respiratory_rate', 'bigint', 'YES', '', None, ''),
 ('temperature', 'double', 'YES', '', None, ''),
 ('oxygen_saturation', 'bigint', 'YES', '', None, ''),
 ('weight', 'double', 'YES', '', None, ''),
 ('height', 'double', 'YES', '', None, ''),
 ('BMI', 'double', 'YES', '', None, ''),
 ('lab_test_name', 'text', 'YES', '', None, ''),
 ('lab_result_value', 'text', 'YES', '', None, ''),
 ('lab_result_unit', 'text', 'YES', '', None, ''),
 ('lab_result_flag', 'text', 'YES', '', None, ''),
 ('collection_date', 'text', 'YES', '', None, '')]

### Exercise 118: Create a materialized view (or emulate with table + refresh) for monthly encounter summaries.

This can't be done in my sql

### Exercise 119: Partition clinical_encounter by YEAR(encounter_date) (if engine supports table partitioning).

In [23]:
%%sql
CREATE TABLE clinical_encounter_part (
    encounter_id INT AUTO_INCREMENT,
    pid VARCHAR(6),
    encounter_date DATE,
    outcome ENUM('Discharged', 'Admitted', 'Referred', 'Deceased'),
    followup_required TINYINT,
    PRIMARY KEY (encounter_id, encounter_date)   -- include encounter_date here
)
PARTITION BY RANGE (YEAR(encounter_date)) (
    PARTITION p2023 VALUES LESS THAN (2024),
    PARTITION p2024 VALUES LESS THAN (2025),
    PARTITION p2025 VALUES LESS THAN (2026),
    PARTITION pmax VALUES LESS THAN MAXVALUE
);

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

# 14. Applied analytics and CASE logic

### Exercise 120: Use CASE to group patients into age bands (<18, 1839, 4059, 60+).

In [29]:
%%sql 
CREATE VIEW age_classified AS 
SELECT pid, first_name, last_name, dob, TIMESTAMPDIFF(YEAR, dob, CURDATE()) AS age, 
CASE WHEN TIMESTAMPDIFF(YEAR, dob, CURDATE()) <18 THEN '<18' 
     WHEN TIMESTAMPDIFF(YEAR, dob, CURDATE()) BETWEEN 18 AND 39 THEN '18-39' 
     WHEN TIMESTAMPDIFF(YEAR, dob, CURDATE()) BETWEEN 40 AND 59 THEN '40-59' 
     WHEN TIMESTAMPDIFF(YEAR, dob, CURDATE()) >= 60 THEN '60+' 
END AS age_bands 
FROM patient_demographics;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [31]:
%sql select * from age_classified LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('00026B', 'Dustin', 'Tate', datetime.date(1991, 10, 20), 34, '18-39'),
 ('00146Z', 'Bethany', 'Lara', datetime.date(2024, 11, 28), 1, '<18'),
 ('00156I', 'Andrea', 'Taylor', datetime.date(1977, 9, 3), 48, '40-59'),
 ('00157V', 'Amy', 'Ramirez', datetime.date(1945, 11, 18), 80, '60+'),
 ('00178H', 'Peter', 'Stuart', datetime.date(1976, 6, 30), 49, '40-59')]

### Exercise 121: Use CASE to categorize BMI (Underweight/Normal/Overweight/Obese) from vitals_and_labs.

In [34]:
%%sql 
CREATE VIEW BMICategory_view AS 
SELECT pd.pid, pd.first_name, pd.last_name, pd.sex, TIMESTAMPDIFF(YEAR, pd.dob, CURDATE()) AS age, 
v.BMI, 
CASE WHEN v.BMI < 18.5 THEN 'Underweight' 
     WHEN v.BMI BETWEEN 18.5 AND 24.9 THEN 'Normal' 
     WHEN v.BMI BETWEEN 25 AND 29.9 THEN 'Overweight' 
     WHEN v.BMI >= 30  THEN 'Obese' 
END AS bmi_category 
FROM patient_demographics pd 
JOIN vitals_and_labs v ON pd.pid=v.pid 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
ORDER BY ce.encounter_date DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

In [36]:
%sql SELECT * FROM BMICategory_view LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('24650U', 'Jordan', 'Mosley', 'Female', 71, 16.4, 'Underweight'),
 ('33005P', 'Steven', 'Villanueva', 'Male', 74, 22.3, 'Normal'),
 ('80446D', 'Cameron', 'Erickson', 'Female', 67, 19.5, 'Normal'),
 ('40573L', 'Thomas', 'MD', 'Female', 2, 22.9, 'Normal'),
 ('03920A', 'Micheal', 'Reeves', 'Male', 59, 14.8, 'Underweight')]

### Exercise 122: Use CASE to label long course medications where duration_days > 14.

In [39]:
%%sql 
SELECT pid, drug_class, drug_name, DATEDIFF(end_date, start_date) AS duration, 
CASE WHEN DATEDIFF(end_date, start_date) <=14 THEN 'short course' 
     WHEN DATEDIFF(end_date, start_date) >14 THEN 'long course' 
END AS duration_category 
FROM medications 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('65639B', 'Antihypertensive', 'Amlodipine', 30, 'long course'),
 ('28988C', 'Antiretroviral', 'Tenofovir', 30, 'long course'),
 ('50817R', 'Antiviral', 'Oseltamivir', 7, 'short course'),
 ('50817R', 'Analgesic', 'Paracetamol', 3, 'short course'),
 ('64615P', 'Antihypertensive', 'Amlodipine', 30, 'long course')]

### Exercise 123: Use CASE to map diagnosis_code (e.g., 'I10'  'Hypertension', 'E11'  'Type 2 Diabetes') inline for a quick demo.

In [40]:
%%sql 
SELECT 
    CASE 
        WHEN diagnosis_code = 'I10' THEN 'Hypertension'
        WHEN diagnosis_code = 'E11' THEN 'Type 2 Diabetes'
        ELSE 'Other / Unknown'
    END AS diagnosis_label,
    COUNT(*) AS patient_count
FROM clinical_encounter
GROUP BY diagnosis_label 
ORDER BY patient_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
3 rows affected.

[('Other / Unknown', 2027), ('Type 2 Diabetes', 487), ('Hypertension', 486)]

### Exercise 124: Use CASE to classify outcomes into Success (Discharged) vs Escalation (Admitted/Referred/Deceased) and count.

In [41]:
%%sql 
SELECT CASE 
       WHEN outcome = 'Discharged' THEN 'Success' 
       WHEN outcome IN ('Admitted', 'Referred', 'Deceased') THEN 'Escalation' 
END AS outcome_category, 
COUNT(*) AS patient_count 
FROM clinical_encounter 
GROUP BY outcome_category 
ORDER BY patient_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
2 rows affected.

[('Escalation', 2215), ('Success', 785)]

# 15. Bonus applied scenarios

### Exercise 125: Find patients with hypertension (I10) and a systolic BP >= 140 on any reading.

In [46]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, TIMESTAMPDIFF(YEAR, pd.dob, CURDATE()) AS age, v.bp_systole 
FROM patient_demographics pd 
JOIN vitals_and_labs v ON pd.pid=v.pid 
WHERE bp_systole >= 140 
ORDER BY age DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('04862K', 'Travis', 'Johnston', 91, 158),
 ('79231Y', 'Angela', 'Mann', 90, 145),
 ('27782K', 'Dennis', 'Mccullough', 90, 160),
 ('32911R', 'Jennifer', 'Mora', 90, 149),
 ('83198P', 'Andrew', 'Johnson', 90, 152)]

### Exercise 126: Find patients with diabetes (E11) prescribed metformin (drug_name LIKE '%metformin%').

In [49]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, TIMESTAMPDIFF(YEAR, pd.dob, CURDATE()) AS age, ce.diagnosis_code   
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
JOIN medications m ON pd.pid=m.pid 
WHERE m.drug_name LIKE '%formin' 
ORDER BY ce.encounter_date DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('03920A', 'Micheal', 'Reeves', 59, 'A09'),
 ('86452W', 'Rebecca', 'Gallagher', 44, 'I10'),
 ('36896R', 'William', 'Payne', 77, 'Z00.0'),
 ('27437D', 'Jonathan', 'West', 33, 'J10.1'),
 ('99914O', 'Brittany', 'Chen', 62, 'E11')]

### Exercise 127: Identify febrile patients (temperature >= 38.0) within 48 hours of an encounter.

In [55]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, ce.encounter_date, ce.diagnosis_code, v.temperature    
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
JOIN vitals_and_labs v ON pd.pid=v.pid 
WHERE ABS(TIMESTAMPDIFF(HOUR, v.collection_date, ce.encounter_date)) <= 48 
          AND v.temperature >= 38.0 
ORDER BY v.temperature DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('94509X', 'Donna', 'Guerrero', datetime.date(2025, 1, 6), 'S06.0', 40.0),
 ('02209J', 'Katherine', 'Jones', datetime.date(2024, 7, 20), 'I10', 40.0),
 ('79209M', 'Latoya', 'Ward', datetime.date(2024, 4, 7), 'J10.1', 40.0),
 ('86035N', 'Trevor', 'Lee', datetime.date(2025, 1, 2), 'J10.1', 40.0),
 ('49224Q', 'Heather', 'Jones', datetime.date(2025, 6, 8), 'J10.1', 40.0)]

### Exercise 128: Identify COPD-like patients (respiratory_rate >= 22 and oxygen_saturation < 92); list last encounter outcome.

In [56]:
%%sql 
SELECT pd.pid, pd.first_name, pd.last_name, ce.encounter_date, ce.diagnosis_code, v.respiratory_rate, v.oxygen_saturation     
FROM patient_demographics pd 
JOIN clinical_encounter ce ON pd.pid=ce.pid 
JOIN vitals_and_labs v ON pd.pid=v.pid 
WHERE v.respiratory_rate >= 22 AND v.oxygen_saturation < 92
ORDER BY ce.encounter_date DESC 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.

[]

### Exercise 129: Build a patient_journey_timeline view that unions encounters, medications, and vitals into a single chronological feed.

In [57]:
%%sql 
SELECT pd.*, ce.*, v.*, m.*, pi.speciality
FROM patient_demographics pd 
LEFT JOIN clinical_encounter ce ON pd.pid = ce.pid 
LEFT JOIN vitals_and_labs v ON pd.pid = v.pid 
LEFT JOIN medications m ON pd.pid = m.pid 
LEFT JOIN provider_information pi ON m.license_number = pi.license_number 
ORDER BY ce.encounter_date 
LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('95315S', 'Courtney', 'Meyer', 'Female', datetime.date(1942, 11, 11), 'Butare', 'High', 'Radiant', Decimal('10.00'), 83, 675, '95315S', datetime.date(2023, 11, 29), 'Inpatient', 'RMH', 'Screening', 'A09', 'Vaccination', 'Deceased', 0, 'Infectious gastroenteritis and colitis, unspecified', 674, 675, '95315S', 164, 107, 79, 12, 36.5, 99, 80.0, 185.7, 23.2, 'Malaria RDT', 'Negative', None, 'Normal', '2023-11-29', None, None, None, None, None, None, None, None, None, None, None, None, None, None),
 ('90305K', 'Laura', 'Jackson', 'Female', datetime.date(1992, 7, 22), 'Byumba', 'High', 'MMI', Decimal('5.00'), 33, 2760, '90305K', datetime.date(2023, 11, 30), 'Inpatient', 'CHUB', 'Headache', 'E11', 'Surgery', 'Deceased', 1, 'Type 2 diabetes mellitus', 2759, 2760, '90305K', 163, 89, 76, 20, 36.5, 94, 80.3, 167.9, 28.5, 'Creatinine', '2.1', 'mg/dL', 'Abnormal', '2023-12-02', 3082, '90305K', 'A09', 'Ciprofloxacin', 'Antibiotic', '500 mg twice daily', 'Oral', 5, datetime.date(2023, 11, 30), datetime.date(2023, 12, 5), 'Dr. Hakizimana', 'RMDC4131', 'Infectious gastroenteritis and colitis, unspecified', 'Internal Medicine'),
 ('84821V', 'Sharon', 'Carter', 'Female', datetime.date(1961, 6, 8), 'Byumba', 'High', 'PIH', Decimal('5.00'), 64, 2912, '84821V', datetime.date(2023, 11, 30), 'Inpatient', 'Kibungo RH', 'Headache', 'E11', 'Surgery', 'Discharged', 0, 'Type 2 diabetes mellitus', 2911, 2912, '84821V', 135, 85, 97, 14, 38.5, 97, 89.2, 166.9, 32.0, 'HIV Test', 'Positive', None, 'Critical', '2023-12-02', 3267, '84821V', 'E11', 'Metformin', 'Antidiabetic', '850 mg daily', 'Oral', 30, datetime.date(2023, 11, 30), datetime.date(2023, 12, 30), 'Dr. Mukamana', 'RMDC7353', 'Type 2 diabetes mellitus', 'Internal Medicine'),
 ('90305K', 'Laura', 'Jackson', 'Female', datetime.date(1992, 7, 22), 'Byumba', 'High', 'MMI', Decimal('5.00'), 33, 2760, '90305K', datetime.date(2023, 11, 30), 'Inpatient', 'CHUB', 'Headache', 'E11', 'Surgery', 'Deceased', 1, 'Type 2 diabetes mellitus', 2759, 2760, '90305K', 163, 89, 76, 20, 36.5, 94, 80.3, 167.9, 28.5, 'Creatinine', '2.1', 'mg/dL', 'Abnormal', '2023-12-02', 3083, '90305K', 'A09', 'ORS', 'Rehydration', '1 sachet after each loose stool', 'Oral', 3, datetime.date(2023, 11, 30), datetime.date(2023, 12, 3), 'Dr. Hakizimana', 'RMDC4131', 'Infectious gastroenteritis and colitis, unspecified', 'Internal Medicine'),
 ('91519L', 'Holly', 'Padilla', 'Female', datetime.date(1967, 7, 17), 'Byumba', 'Low', 'None', Decimal('100.00'), 58, 1856, '91519L', datetime.date(2023, 11, 30), 'Inpatient', 'Kibungo RH', 'Headache', 'I10', 'MRI', 'Admitted', 1, 'Essential (primary) hypertension', 1855, 1856, '91519L', 105, 97, 70, 20, 38.1, 99, 70.9, 170.6, 24.4, 'Glucosemia', '7.3', 'mmol/L', 'Abnormal', '2023-12-03', 2101, '91519L', 'I10', 'Amlodipine', 'Antihypertensive', '5 mg daily', 'Oral', 30, datetime.date(2023, 11, 30), datetime.date(2023, 12, 30), 'Dr. Mugisha', 'RMDC1079', 'Essential (primary) hypertension', 'Internal Medicine')]

### Exercise 130: Build an antibiotic stewardship dashboard: rates by prescriber, facility, and speciality via views.

In [64]:
%%sql 
DROP VIEW IF EXISTS antibiotic_stewardship_view; 
CREATE VIEW antibiotic_stewardship_view AS 
SELECT pi.license_number, pi.provider_name, pi.facility, pi.speciality, COUNT(*) AS antibiotic_prescription_count 
FROM medications m 
JOIN provider_information pi ON m.license_number=pi.license_number 
WHERE m.drug_class = 'Antibiotic' 
GROUP BY pi.license_number, pi.provider_name, pi.facility, pi.speciality 
ORDER BY antibiotic_prescription_count DESC;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.

[]

In [65]:
# Let's call our view 
%sql SELECT * FROM antibiotic_stewardship_view;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('RMDC2727', 'Dr. Uwamahoro', 'CHUB', 'Surgery', 82),
 ('RMDC6153', 'Dr. Kayitesi', 'CHUK', 'Internal Medicine', 78),
 ('RMDC4131', 'Dr. Hakizimana', 'Kibungo RH', 'Internal Medicine', 75),
 ('RMDC1079', 'Dr. Mugisha', 'Kibuye RH', 'Internal Medicine', 73),
 ('RMDC7353', 'Dr. Mukamana', 'CHUB', 'Internal Medicine', 72)]

### Exercise 131: Build a chronic disease registry report: patients with I10 or E11, last vitals, last medication class.

In [73]:
%%sql
DROP VIEW IF EXISTS monthly_chronic_case_view;

CREATE VIEW monthly_chronic_case_view AS
SELECT 
    pd.pid, 
    pd.first_name, 
    pd.last_name, 
    TIMESTAMPDIFF(YEAR, pd.dob, CURDATE()) AS age,
    ce.diagnosis_code, 
    v.bp_systole, v.bp_diastole, v.heart_rate, v.respiratory_rate, v.temperature,
    v.oxygen_saturation, v.weight, v.height, v.bmi, v.lab_test_name, v.lab_result_value,
    v.lab_result_unit, v.lab_result_flag, v.collection_date,
    m.drug_class, m.drug_name, m.route, m.duration_days 
FROM patient_demographics pd
JOIN vitals_and_labs v ON pd.pid = v.pid
JOIN medications m ON pd.pid = m.pid
JOIN clinical_encounter ce ON pd.pid = ce.pid
WHERE ce.diagnosis_code IN ('I10', 'E11')
  AND ce.encounter_date >= DATE_FORMAT(CURDATE() - INTERVAL 1 MONTH, '%Y-%m-01')
  AND ce.encounter_date < DATE_FORMAT(CURDATE(), '%Y-%m-01') 
ORDER BY ce.encounter_date;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.

[]

In [74]:
%sql SELECT * FROM monthly_chronic_case_view LIMIT 5;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
5 rows affected.

[('34317D', 'Valerie', 'Sims', 27, 'I10', 108, 110, 75, 17, 37.7, 96, 58.0, 157.2, 23.5, 'Hemoglobin', '15.8', 'g/dL', 'Normal', '2025-11-03', 'Antibiotic', 'Ciprofloxacin', 'Oral', 5),
 ('34317D', 'Valerie', 'Sims', 27, 'I10', 108, 110, 75, 17, 37.7, 96, 58.0, 157.2, 23.5, 'Hemoglobin', '15.8', 'g/dL', 'Normal', '2025-11-03', 'Rehydration', 'ORS', 'Oral', 3),
 ('69033A', 'James', 'Ayala', 46, 'I10', 106, 74, 84, 20, 39.7, 95, 51.8, 172.4, 17.4, 'Creatinine', '2.8', 'mg/dL', 'Critical', '2025-11-05', 'Antihypertensive', 'Amlodipine', 'Oral', 30),
 ('49659M', 'Ian', 'Taylor', 4, 'E11', 100, 78, 64, 12, 36.5, 99, 71.9, 152.9, 30.8, 'Hemoglobin', '12.0', 'g/dL', 'Normal', '2025-11-04', 'Analgesic', 'Paracetamol', 'Oral', 3),
 ('33240D', 'Jennifer', 'Middleton', 80, 'I10', 161, 90, 67, 13, 36.1, 98, 63.5, 152.1, 27.4, 'HIV Test', 'Negative', None, 'Normal', '2025-11-04', 'Antimalarial', 'Artemether-Lumefantrine', 'Oral', 3)]

### Exercise 132: Build a safety report: counts of critical lab_result_flag by facility and month.

In [79]:
%%sql 
DROP VIEW IF EXISTS critical_lab_results_view; 
CREATE VIEW critical_lab_results_view AS 
SELECT ce.facility, YEAR(v.collection_date) AS year, MONTH(v.collection_date) AS month, COUNT(*) AS critical_lab_count 
FROM vitals_and_labs v 
JOIN clinical_encounter ce ON v.pid=ce.pid 
WHERE v.lab_result_flag = 'Critical' 
GROUP BY ce.facility, year, month 
ORDER BY ce.facility, year, month;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.

[]

### Exercise 133: Build a capacity report: inpatient vs outpatient trends per facility over the last 12 months.

In [82]:
%%sql 
DROP VIEW IF EXISTS facility_capacity_trends;

CREATE VIEW facility_capacity_trends_view AS
SELECT 
    ce.facility,
    YEAR(ce.encounter_date) AS year,
    MONTH(ce.encounter_date) AS month_num,
    ce.encounter_type,
    COUNT(*) AS encounter_count
FROM clinical_encounter ce
WHERE ce.encounter_date >= DATE_FORMAT(CURDATE() - INTERVAL 12 MONTH, '%Y-%m-01')
  AND ce.encounter_date < DATE_FORMAT(CURDATE(), '%Y-%m-01')
GROUP BY ce.facility, year, month_num, encounter_type
ORDER BY ce.facility, year, month_num, encounter_type;

 * mysql+mysqlconnector://njado:***@localhost:3306/HospitalDB
0 rows affected.
0 rows affected.

[]

# Conclusion 

The series of SQL exercises undertaken in this project illustrate the critical role of structured query design in transforming hospital data into meaningful evidence for health systems analysis. By employing advanced techniques such as CASE expressions for patient stratification, partitioning strategies for efficient data management, indexing for query optimization, and view creation for longitudinal reporting, the work demonstrates how relational databases can be leveraged to support both clinical and operational decisionmaking. The outputsranging from demographic age bands and BMI classifications to chronic illness monitoring, antibiotic stewardship, and facility capacity trendsunderscore the capacity of SQL to generate reproducible, scalable, and analytically rigorous insights. Collectively, these exercises highlight the methodological importance of database literacy in global health delivery, where accurate, timely, and contextsensitive information is indispensable for evidencebased practice and policy formulation.